PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Tue Oct 25 14:20:15 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/root/EmbeddedLinux/hw07/pru")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("CT_CFG")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$69)
      19        .dwattr $C$DW$1, DW_AT_external

     100;*                                                             *
     101;* FUNCTION ENVIRONMENT                                        *
     102;*                                                             *
     103;* FUNCTION PROPERTIES                                         *
     104;*                            0 Auto,  0 SOE     *
     105;***************************************************************
     106
     107 00000000                 ||main||:
     108;* --------------------------------------------------------------------------*
     109        .dwcfi  cfa_offset, 0
     110        .dwpsn  file "main_pru0.c",line 60,column 2,is_stmt,isa 0
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111;----------------------------------------------------------------------
     112;  60 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     113;  63 | //Wait until the input rises, then output high                         
     114;  64 | //Wait until the input falls, then output low                          
     115;  65 | while(1){                                                              
     116;----------------------------------------------------------------------
     117 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |60| CT_CFG
     118 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |60| 
     119 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |60| CT_CFG
     120;* --------------------------------------------------------------------------*
     121;*   BEGIN LOOP ||$C$L1||
     122;*
     123;*   Loop source line                : 66
     124;*   Loop closing brace source line  : 66
     125;*   Known Minimum Trip Count        : 1
     126;*   Known Maximum Trip Count        : 4294967295
     127;*   Known Max Trip Count Factor     : 1
     128;* --------------------------------------------------------------------------*
     129 0000000c                 ||$C$L1||:    
     130        .dwpsn  file "main_pru0.c",line 66,column 9,is_stmt,isa 0
     131;----------------------------------------------------------------------
     132;  66 | while(!(__R31&(1<<leader)));                                           
     133;----------------------------------------------------------------------
     134 0000000c 000000C910FF00          QBBC      ||$C$L1||, r31, 0x10  ; [ALU_PRU] |66| 
     135;* --------------------------------------------------------------------------*
     136        .dwpsn  file "main_pru0.c",line 67,column 3,is_stmt,isa 0
     137;----------------------------------------------------------------------
     138;  67 | __R30 |= 1<<follower;                                                  
     139;----------------------------------------------------------------------
     140 00000010 0000001F05FEFE          SET       r30, r30, 0x00000005  ; [ALU_PRU] |67| 
     141;* --------------------------------------------------------------------------*
     142;*   BEGIN LOOP ||$C$L2||
     143;*
     144;*   Loop source line                : 68
     145;*   Loop closing brace source line  : 68
     146;*   Known Minimum Trip Count        : 1
     147;*   Known Maximum Trip Count        : 4294967295
     148;*   Known Max Trip Count Factor     : 1
     149;* --------------------------------------------------------------------------*
     150 00000014                 ||$C$L2||:    
     151        .dwpsn  file "main_pru0.c",line 68,column 3,is_stmt,isa 0
     152;----------------------------------------------------------------------
     153;  68 | while(__R31&(1<<leader));                                              
     154;----------------------------------------------------------------------
     155 00000014 000000D110FF00          QBBS      ||$C$L2||, r31, 0x10  ; [ALU_PRU] |68| 
     156;* --------------------------------------------------------------------------*
     157        .dwpsn  file "main_pru0.c",line 69,column 3,is_stmt,isa 0
     158;----------------------------------------------------------------------
     159;  69 | __R30 ^= 1<<follower;                                                  
     160;----------------------------------------------------------------------
     161 00000018 0000001520FEFE          XOR       r30, r30, 0x20        ; [ALU_PRU] |69| 
     162        .dwpsn  file "main_pru0.c",line 65,column 8,is_stmt,isa 0
     163 0000001c 00000021000000!         JMP       ||$C$L1||             ; [ALU_PRU] |65| 
     164;* --------------------------------------------------------------------------*
     165        .dwattr $C$DW$5, DW_AT_TI_end_file("main_pru0.c")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166        .dwattr $C$DW$5, DW_AT_TI_end_line(0x47)
     167        .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     168        .dwendentry
     169        .dwendtag $C$DW$5
     170
     171
     172;******************************************************************************
     173;* TYPE INFORMATION                                                           *
     174;******************************************************************************
     175
     176$C$DW$T$19      .dwtag  DW_TAG_structure_type
     177        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     178$C$DW$6 .dwtag  DW_TAG_member
     179        .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$11)
     180        .dwattr $C$DW$6, DW_AT_name("REVID")
     181        .dwattr $C$DW$6, DW_AT_TI_symbol_name("REVID")
     182        .dwattr $C$DW$6, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     183        .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     184        .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     185        .dwattr $C$DW$6, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     186        .dwattr $C$DW$6, DW_AT_decl_line(0x2d)
     187        .dwattr $C$DW$6, DW_AT_decl_column(0x0d)
     188        .dwendtag $C$DW$T$19
     189
     190        .dwattr $C$DW$T$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     191        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     192        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     193$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     194        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     195
     196$C$DW$T$20      .dwtag  DW_TAG_structure_type
     197        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     198$C$DW$7 .dwtag  DW_TAG_member
     199        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     200        .dwattr $C$DW$7, DW_AT_name("IDLE_MODE")
     201        .dwattr $C$DW$7, DW_AT_TI_symbol_name("IDLE_MODE")
     202        .dwattr $C$DW$7, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     203        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     204        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     205        .dwattr $C$DW$7, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     206        .dwattr $C$DW$7, DW_AT_decl_line(0x37)
     207        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     208$C$DW$8 .dwtag  DW_TAG_member
     209        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     210        .dwattr $C$DW$8, DW_AT_name("STANDBY_MODE")
     211        .dwattr $C$DW$8, DW_AT_TI_symbol_name("STANDBY_MODE")
     212        .dwattr $C$DW$8, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     213        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     214        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     215        .dwattr $C$DW$8, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     216        .dwattr $C$DW$8, DW_AT_decl_line(0x38)
     217        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     218$C$DW$9 .dwtag  DW_TAG_member
     219        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     220        .dwattr $C$DW$9, DW_AT_name("STANDBY_INIT")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_INIT")
     222        .dwattr $C$DW$9, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     223        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     224        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     225        .dwattr $C$DW$9, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     226        .dwattr $C$DW$9, DW_AT_decl_line(0x39)
     227        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     228$C$DW$10        .dwtag  DW_TAG_member
     229        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     230        .dwattr $C$DW$10, DW_AT_name("SUB_MWAIT")
     231        .dwattr $C$DW$10, DW_AT_TI_symbol_name("SUB_MWAIT")
     232        .dwattr $C$DW$10, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     233        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     234        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     235        .dwattr $C$DW$10, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     236        .dwattr $C$DW$10, DW_AT_decl_line(0x3a)
     237        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     238$C$DW$11        .dwtag  DW_TAG_member
     239        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     240        .dwattr $C$DW$11, DW_AT_name("rsvd6")
     241        .dwattr $C$DW$11, DW_AT_TI_symbol_name("rsvd6")
     242        .dwattr $C$DW$11, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     243        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     244        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     245        .dwattr $C$DW$11, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     246        .dwattr $C$DW$11, DW_AT_decl_line(0x3b)
     247        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     248        .dwendtag $C$DW$T$20
     249
     250        .dwattr $C$DW$T$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     251        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     252        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     253$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     254        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     255
     256$C$DW$T$21      .dwtag  DW_TAG_structure_type
     257        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     258$C$DW$12        .dwtag  DW_TAG_member
     259        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     260        .dwattr $C$DW$12, DW_AT_name("PRU0_GPI_MODE")
     261        .dwattr $C$DW$12, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     262        .dwattr $C$DW$12, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     263        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     264        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     265        .dwattr $C$DW$12, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     266        .dwattr $C$DW$12, DW_AT_decl_line(0x45)
     267        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     268$C$DW$13        .dwtag  DW_TAG_member
     269        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     270        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_CLK_MODE")
     271        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     272        .dwattr $C$DW$13, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     273        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     274        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     275        .dwattr $C$DW$13, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276        .dwattr $C$DW$13, DW_AT_decl_line(0x46)
     277        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     278$C$DW$14        .dwtag  DW_TAG_member
     279        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     280        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_DIV0")
     281        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     282        .dwattr $C$DW$14, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     283        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     284        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     285        .dwattr $C$DW$14, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     286        .dwattr $C$DW$14, DW_AT_decl_line(0x47)
     287        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     288$C$DW$15        .dwtag  DW_TAG_member
     289        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     290        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV1")
     291        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     292        .dwattr $C$DW$15, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     293        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     295        .dwattr $C$DW$15, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     296        .dwattr $C$DW$15, DW_AT_decl_line(0x48)
     297        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     298$C$DW$16        .dwtag  DW_TAG_member
     299        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     300        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_SB")
     301        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     302        .dwattr $C$DW$16, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     303        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     304        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     305        .dwattr $C$DW$16, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     306        .dwattr $C$DW$16, DW_AT_decl_line(0x49)
     307        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     308$C$DW$17        .dwtag  DW_TAG_member
     309        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     310        .dwattr $C$DW$17, DW_AT_name("PRU0_GPO_MODE")
     311        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     312        .dwattr $C$DW$17, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     313        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     314        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     315        .dwattr $C$DW$17, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     316        .dwattr $C$DW$17, DW_AT_decl_line(0x4a)
     317        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     318$C$DW$18        .dwtag  DW_TAG_member
     319        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     320        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_DIV0")
     321        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     322        .dwattr $C$DW$18, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     323        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     325        .dwattr $C$DW$18, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     326        .dwattr $C$DW$18, DW_AT_decl_line(0x4b)
     327        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     328$C$DW$19        .dwtag  DW_TAG_member
     329        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     330        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV1")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     332        .dwattr $C$DW$19, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     333        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     334        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     335        .dwattr $C$DW$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     336        .dwattr $C$DW$19, DW_AT_decl_line(0x4c)
     337        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     338$C$DW$20        .dwtag  DW_TAG_member
     339        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     340        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_SH_SEL")
     341        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     342        .dwattr $C$DW$20, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     343        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     344        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     345        .dwattr $C$DW$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     346        .dwattr $C$DW$20, DW_AT_decl_line(0x4d)
     347        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     348$C$DW$21        .dwtag  DW_TAG_member
     349        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     350        .dwattr $C$DW$21, DW_AT_name("rsvd26")
     351        .dwattr $C$DW$21, DW_AT_TI_symbol_name("rsvd26")
     352        .dwattr $C$DW$21, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     353        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     354        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     355        .dwattr $C$DW$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     356        .dwattr $C$DW$21, DW_AT_decl_line(0x4e)
     357        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     358        .dwendtag $C$DW$T$21
     359
     360        .dwattr $C$DW$T$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     361        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     362        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     363$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     364        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     365
     366$C$DW$T$22      .dwtag  DW_TAG_structure_type
     367        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     368$C$DW$22        .dwtag  DW_TAG_member
     369        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     370        .dwattr $C$DW$22, DW_AT_name("PRU1_GPI_MODE")
     371        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     372        .dwattr $C$DW$22, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     373        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     374        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     375        .dwattr $C$DW$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     376        .dwattr $C$DW$22, DW_AT_decl_line(0x58)
     377        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     378$C$DW$23        .dwtag  DW_TAG_member
     379        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     380        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_CLK_MODE")
     381        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     382        .dwattr $C$DW$23, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     383        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     384        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     385        .dwattr $C$DW$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386        .dwattr $C$DW$23, DW_AT_decl_line(0x59)
     387        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     388$C$DW$24        .dwtag  DW_TAG_member
     389        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     390        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_DIV0")
     391        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     392        .dwattr $C$DW$24, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     393        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     395        .dwattr $C$DW$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     396        .dwattr $C$DW$24, DW_AT_decl_line(0x5a)
     397        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     398$C$DW$25        .dwtag  DW_TAG_member
     399        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     400        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV1")
     401        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     402        .dwattr $C$DW$25, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     403        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     404        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     405        .dwattr $C$DW$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     406        .dwattr $C$DW$25, DW_AT_decl_line(0x5b)
     407        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     408$C$DW$26        .dwtag  DW_TAG_member
     409        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     410        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_SB")
     411        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     412        .dwattr $C$DW$26, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     413        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     414        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     415        .dwattr $C$DW$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     416        .dwattr $C$DW$26, DW_AT_decl_line(0x5c)
     417        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     418$C$DW$27        .dwtag  DW_TAG_member
     419        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     420        .dwattr $C$DW$27, DW_AT_name("PRU1_GPO_MODE")
     421        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     422        .dwattr $C$DW$27, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     423        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     425        .dwattr $C$DW$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     426        .dwattr $C$DW$27, DW_AT_decl_line(0x5d)
     427        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     428$C$DW$28        .dwtag  DW_TAG_member
     429        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     430        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_DIV0")
     431        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     432        .dwattr $C$DW$28, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     433        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     435        .dwattr $C$DW$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     436        .dwattr $C$DW$28, DW_AT_decl_line(0x5e)
     437        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     438$C$DW$29        .dwtag  DW_TAG_member
     439        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     440        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV1")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     442        .dwattr $C$DW$29, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     443        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     445        .dwattr $C$DW$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     446        .dwattr $C$DW$29, DW_AT_decl_line(0x5f)
     447        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     448$C$DW$30        .dwtag  DW_TAG_member
     449        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     450        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_SH_SEL")
     451        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     452        .dwattr $C$DW$30, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     453        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     454        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     455        .dwattr $C$DW$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     456        .dwattr $C$DW$30, DW_AT_decl_line(0x60)
     457        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     458$C$DW$31        .dwtag  DW_TAG_member
     459        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     460        .dwattr $C$DW$31, DW_AT_name("rsvd26")
     461        .dwattr $C$DW$31, DW_AT_TI_symbol_name("rsvd26")
     462        .dwattr $C$DW$31, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     463        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     465        .dwattr $C$DW$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     466        .dwattr $C$DW$31, DW_AT_decl_line(0x61)
     467        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     468        .dwendtag $C$DW$T$22
     469
     470        .dwattr $C$DW$T$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     471        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     472        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     473$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     474        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     475
     476$C$DW$T$23      .dwtag  DW_TAG_structure_type
     477        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     478$C$DW$32        .dwtag  DW_TAG_member
     479        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     480        .dwattr $C$DW$32, DW_AT_name("PRU0_CLK_STOP_REQ")
     481        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     482        .dwattr $C$DW$32, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     483        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     484        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     485        .dwattr $C$DW$32, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     486        .dwattr $C$DW$32, DW_AT_decl_line(0x6b)
     487        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     488$C$DW$33        .dwtag  DW_TAG_member
     489        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     490        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_ACK")
     491        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     492        .dwattr $C$DW$33, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     493        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     495        .dwattr $C$DW$33, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496        .dwattr $C$DW$33, DW_AT_decl_line(0x6c)
     497        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     498$C$DW$34        .dwtag  DW_TAG_member
     499        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     500        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_EN")
     501        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     502        .dwattr $C$DW$34, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     503        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     504        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     505        .dwattr $C$DW$34, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     506        .dwattr $C$DW$34, DW_AT_decl_line(0x6d)
     507        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     508$C$DW$35        .dwtag  DW_TAG_member
     509        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     510        .dwattr $C$DW$35, DW_AT_name("PRU1_CLK_STOP_REQ")
     511        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     512        .dwattr $C$DW$35, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     513        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     514        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     515        .dwattr $C$DW$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     516        .dwattr $C$DW$35, DW_AT_decl_line(0x6e)
     517        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     518$C$DW$36        .dwtag  DW_TAG_member
     519        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     520        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_ACK")
     521        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     522        .dwattr $C$DW$36, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     523        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     525        .dwattr $C$DW$36, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     526        .dwattr $C$DW$36, DW_AT_decl_line(0x6f)
     527        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     528$C$DW$37        .dwtag  DW_TAG_member
     529        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     530        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_EN")
     531        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     532        .dwattr $C$DW$37, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     533        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     534        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     535        .dwattr $C$DW$37, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     536        .dwattr $C$DW$37, DW_AT_decl_line(0x70)
     537        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     538$C$DW$38        .dwtag  DW_TAG_member
     539        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     540        .dwattr $C$DW$38, DW_AT_name("INTC_CLK_STOP_REQ")
     541        .dwattr $C$DW$38, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     542        .dwattr $C$DW$38, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     543        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     544        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     545        .dwattr $C$DW$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     546        .dwattr $C$DW$38, DW_AT_decl_line(0x71)
     547        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     548$C$DW$39        .dwtag  DW_TAG_member
     549        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     550        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_ACK")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     552        .dwattr $C$DW$39, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     553        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     554        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     555        .dwattr $C$DW$39, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     556        .dwattr $C$DW$39, DW_AT_decl_line(0x72)
     557        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     558$C$DW$40        .dwtag  DW_TAG_member
     559        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     560        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_EN")
     561        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_EN")
     562        .dwattr $C$DW$40, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     563        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     565        .dwattr $C$DW$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     566        .dwattr $C$DW$40, DW_AT_decl_line(0x73)
     567        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     568$C$DW$41        .dwtag  DW_TAG_member
     569        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     570        .dwattr $C$DW$41, DW_AT_name("UART_CLK_STOP_REQ")
     571        .dwattr $C$DW$41, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     572        .dwattr $C$DW$41, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     573        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     575        .dwattr $C$DW$41, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     576        .dwattr $C$DW$41, DW_AT_decl_line(0x74)
     577        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     578$C$DW$42        .dwtag  DW_TAG_member
     579        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     580        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_ACK")
     581        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     582        .dwattr $C$DW$42, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     583        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     585        .dwattr $C$DW$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     586        .dwattr $C$DW$42, DW_AT_decl_line(0x75)
     587        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     588$C$DW$43        .dwtag  DW_TAG_member
     589        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     590        .dwattr $C$DW$43, DW_AT_name("UART_CLK_EN")
     591        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_EN")
     592        .dwattr $C$DW$43, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     593        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     595        .dwattr $C$DW$43, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     596        .dwattr $C$DW$43, DW_AT_decl_line(0x76)
     597        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     598$C$DW$44        .dwtag  DW_TAG_member
     599        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     600        .dwattr $C$DW$44, DW_AT_name("ECAP_CLK_STOP_REQ")
     601        .dwattr $C$DW$44, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     602        .dwattr $C$DW$44, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     603        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     605        .dwattr $C$DW$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606        .dwattr $C$DW$44, DW_AT_decl_line(0x77)
     607        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     608$C$DW$45        .dwtag  DW_TAG_member
     609        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     610        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_ACK")
     611        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     612        .dwattr $C$DW$45, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     613        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     615        .dwattr $C$DW$45, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     616        .dwattr $C$DW$45, DW_AT_decl_line(0x78)
     617        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     618$C$DW$46        .dwtag  DW_TAG_member
     619        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     620        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_EN")
     621        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     622        .dwattr $C$DW$46, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     623        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     624        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     625        .dwattr $C$DW$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     626        .dwattr $C$DW$46, DW_AT_decl_line(0x79)
     627        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     628$C$DW$47        .dwtag  DW_TAG_member
     629        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     630        .dwattr $C$DW$47, DW_AT_name("IEP_CLK_STOP_REQ")
     631        .dwattr $C$DW$47, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     632        .dwattr $C$DW$47, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     633        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     635        .dwattr $C$DW$47, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     636        .dwattr $C$DW$47, DW_AT_decl_line(0x7a)
     637        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     638$C$DW$48        .dwtag  DW_TAG_member
     639        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     640        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_ACK")
     641        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     642        .dwattr $C$DW$48, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     643        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     645        .dwattr $C$DW$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     646        .dwattr $C$DW$48, DW_AT_decl_line(0x7b)
     647        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     648$C$DW$49        .dwtag  DW_TAG_member
     649        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     650        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_EN")
     651        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_EN")
     652        .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     653        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     654        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     655        .dwattr $C$DW$49, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     656        .dwattr $C$DW$49, DW_AT_decl_line(0x7c)
     657        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     658$C$DW$50        .dwtag  DW_TAG_member
     659        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     660        .dwattr $C$DW$50, DW_AT_name("rsvd18")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661        .dwattr $C$DW$50, DW_AT_TI_symbol_name("rsvd18")
     662        .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     663        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     665        .dwattr $C$DW$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     666        .dwattr $C$DW$50, DW_AT_decl_line(0x7d)
     667        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     668        .dwendtag $C$DW$T$23
     669
     670        .dwattr $C$DW$T$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     671        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     672        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     673$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     674        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     675
     676$C$DW$T$24      .dwtag  DW_TAG_structure_type
     677        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     678$C$DW$51        .dwtag  DW_TAG_member
     679        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     680        .dwattr $C$DW$51, DW_AT_name("PRU0_IMEM_PE_RAW")
     681        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     682        .dwattr $C$DW$51, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     683        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     685        .dwattr $C$DW$51, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     686        .dwattr $C$DW$51, DW_AT_decl_line(0x87)
     687        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     688$C$DW$52        .dwtag  DW_TAG_member
     689        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     690        .dwattr $C$DW$52, DW_AT_name("PRU0_DMEM_PE_RAW")
     691        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     692        .dwattr $C$DW$52, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     693        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     695        .dwattr $C$DW$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     696        .dwattr $C$DW$52, DW_AT_decl_line(0x88)
     697        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     698$C$DW$53        .dwtag  DW_TAG_member
     699        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     700        .dwattr $C$DW$53, DW_AT_name("PRU1_IMEM_PE_RAW")
     701        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     702        .dwattr $C$DW$53, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     703        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     705        .dwattr $C$DW$53, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     706        .dwattr $C$DW$53, DW_AT_decl_line(0x89)
     707        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     708$C$DW$54        .dwtag  DW_TAG_member
     709        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     710        .dwattr $C$DW$54, DW_AT_name("PRU1_DMEM_PE_RAW")
     711        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     712        .dwattr $C$DW$54, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     713        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     715        .dwattr $C$DW$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716        .dwattr $C$DW$54, DW_AT_decl_line(0x8a)
     717        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     718$C$DW$55        .dwtag  DW_TAG_member
     719        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     720        .dwattr $C$DW$55, DW_AT_name("RAM_PE_RAW")
     721        .dwattr $C$DW$55, DW_AT_TI_symbol_name("RAM_PE_RAW")
     722        .dwattr $C$DW$55, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     723        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     725        .dwattr $C$DW$55, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     726        .dwattr $C$DW$55, DW_AT_decl_line(0x8b)
     727        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     728$C$DW$56        .dwtag  DW_TAG_member
     729        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     730        .dwattr $C$DW$56, DW_AT_name("rsvd20")
     731        .dwattr $C$DW$56, DW_AT_TI_symbol_name("rsvd20")
     732        .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     733        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     735        .dwattr $C$DW$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     736        .dwattr $C$DW$56, DW_AT_decl_line(0x8c)
     737        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     738        .dwendtag $C$DW$T$24
     739
     740        .dwattr $C$DW$T$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     741        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     742        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     743$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     744        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     745
     746$C$DW$T$25      .dwtag  DW_TAG_structure_type
     747        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     748$C$DW$57        .dwtag  DW_TAG_member
     749        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     750        .dwattr $C$DW$57, DW_AT_name("PRU0_IMEM_PE")
     751        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     752        .dwattr $C$DW$57, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     753        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     755        .dwattr $C$DW$57, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     756        .dwattr $C$DW$57, DW_AT_decl_line(0x96)
     757        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     758$C$DW$58        .dwtag  DW_TAG_member
     759        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     760        .dwattr $C$DW$58, DW_AT_name("PRU0_DMEM_PE")
     761        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     762        .dwattr $C$DW$58, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     763        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     765        .dwattr $C$DW$58, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     766        .dwattr $C$DW$58, DW_AT_decl_line(0x97)
     767        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     768$C$DW$59        .dwtag  DW_TAG_member
     769        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     770        .dwattr $C$DW$59, DW_AT_name("PRU1_IMEM_PE")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     772        .dwattr $C$DW$59, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     773        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     775        .dwattr $C$DW$59, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     776        .dwattr $C$DW$59, DW_AT_decl_line(0x98)
     777        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     778$C$DW$60        .dwtag  DW_TAG_member
     779        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     780        .dwattr $C$DW$60, DW_AT_name("PRU1_DMEM_PE")
     781        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     782        .dwattr $C$DW$60, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     783        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     785        .dwattr $C$DW$60, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     786        .dwattr $C$DW$60, DW_AT_decl_line(0x99)
     787        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     788$C$DW$61        .dwtag  DW_TAG_member
     789        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     790        .dwattr $C$DW$61, DW_AT_name("RAM_PE")
     791        .dwattr $C$DW$61, DW_AT_TI_symbol_name("RAM_PE")
     792        .dwattr $C$DW$61, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     793        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     795        .dwattr $C$DW$61, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     796        .dwattr $C$DW$61, DW_AT_decl_line(0x9a)
     797        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     798$C$DW$62        .dwtag  DW_TAG_member
     799        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     800        .dwattr $C$DW$62, DW_AT_name("rsvd20")
     801        .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd20")
     802        .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     803        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     805        .dwattr $C$DW$62, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     806        .dwattr $C$DW$62, DW_AT_decl_line(0x9b)
     807        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     808        .dwendtag $C$DW$T$25
     809
     810        .dwattr $C$DW$T$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     811        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     812        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     813$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     814        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     815
     816$C$DW$T$26      .dwtag  DW_TAG_structure_type
     817        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     818$C$DW$63        .dwtag  DW_TAG_member
     819        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     820        .dwattr $C$DW$63, DW_AT_name("PRU0_IMEM_PE_SET")
     821        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     822        .dwattr $C$DW$63, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     823        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     825        .dwattr $C$DW$63, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826        .dwattr $C$DW$63, DW_AT_decl_line(0xa4)
     827        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     828$C$DW$64        .dwtag  DW_TAG_member
     829        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     830        .dwattr $C$DW$64, DW_AT_name("PRU0_DMEM_PE_SET")
     831        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     832        .dwattr $C$DW$64, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     833        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     835        .dwattr $C$DW$64, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     836        .dwattr $C$DW$64, DW_AT_decl_line(0xa5)
     837        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     838$C$DW$65        .dwtag  DW_TAG_member
     839        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     840        .dwattr $C$DW$65, DW_AT_name("PRU1_IMEM_PE_SET")
     841        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     842        .dwattr $C$DW$65, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     843        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     845        .dwattr $C$DW$65, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     846        .dwattr $C$DW$65, DW_AT_decl_line(0xa6)
     847        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     848$C$DW$66        .dwtag  DW_TAG_member
     849        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     850        .dwattr $C$DW$66, DW_AT_name("PRU1_DMEM_PE_SET")
     851        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     852        .dwattr $C$DW$66, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     853        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     855        .dwattr $C$DW$66, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     856        .dwattr $C$DW$66, DW_AT_decl_line(0xa7)
     857        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     858$C$DW$67        .dwtag  DW_TAG_member
     859        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     860        .dwattr $C$DW$67, DW_AT_name("RAM_PE_SET")
     861        .dwattr $C$DW$67, DW_AT_TI_symbol_name("RAM_PE_SET")
     862        .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     863        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     865        .dwattr $C$DW$67, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     866        .dwattr $C$DW$67, DW_AT_decl_line(0xa8)
     867        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     868$C$DW$68        .dwtag  DW_TAG_member
     869        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     870        .dwattr $C$DW$68, DW_AT_name("rsvd20")
     871        .dwattr $C$DW$68, DW_AT_TI_symbol_name("rsvd20")
     872        .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     873        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     875        .dwattr $C$DW$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     876        .dwattr $C$DW$68, DW_AT_decl_line(0xa9)
     877        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     878        .dwendtag $C$DW$T$26
     879
     880        .dwattr $C$DW$T$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     882        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     883$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     884        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
     885
     886$C$DW$T$27      .dwtag  DW_TAG_structure_type
     887        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     888$C$DW$69        .dwtag  DW_TAG_member
     889        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     890        .dwattr $C$DW$69, DW_AT_name("PRU0_IMEM_PE_CLR")
     891        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     892        .dwattr $C$DW$69, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     893        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     894        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     895        .dwattr $C$DW$69, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     896        .dwattr $C$DW$69, DW_AT_decl_line(0xb3)
     897        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     898$C$DW$70        .dwtag  DW_TAG_member
     899        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     900        .dwattr $C$DW$70, DW_AT_name("PRU0_DMEM_PE_CLR")
     901        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     902        .dwattr $C$DW$70, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     903        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     905        .dwattr $C$DW$70, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     906        .dwattr $C$DW$70, DW_AT_decl_line(0xb4)
     907        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     908$C$DW$71        .dwtag  DW_TAG_member
     909        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     910        .dwattr $C$DW$71, DW_AT_name("PRU1_IMEM_PE_CLR")
     911        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     912        .dwattr $C$DW$71, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     913        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     915        .dwattr $C$DW$71, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     916        .dwattr $C$DW$71, DW_AT_decl_line(0xb5)
     917        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     918$C$DW$72        .dwtag  DW_TAG_member
     919        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     920        .dwattr $C$DW$72, DW_AT_name("PRU1_DMEM_PE_CLR")
     921        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     922        .dwattr $C$DW$72, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     923        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     924        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     925        .dwattr $C$DW$72, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     926        .dwattr $C$DW$72, DW_AT_decl_line(0xb6)
     927        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     928$C$DW$73        .dwtag  DW_TAG_member
     929        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     930        .dwattr $C$DW$73, DW_AT_name("rsvd16")
     931        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd16")
     932        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     933        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     935        .dwattr $C$DW$73, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwattr $C$DW$73, DW_AT_decl_line(0xb7)
     937        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     938        .dwendtag $C$DW$T$27
     939
     940        .dwattr $C$DW$T$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     941        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     942        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     943$C$DW$T$53      .dwtag  DW_TAG_volatile_type
     944        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     945
     946$C$DW$T$28      .dwtag  DW_TAG_structure_type
     947        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     948$C$DW$74        .dwtag  DW_TAG_member
     949        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     950        .dwattr $C$DW$74, DW_AT_name("PMAO_PRU0")
     951        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PMAO_PRU0")
     952        .dwattr $C$DW$74, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     953        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     955        .dwattr $C$DW$74, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     956        .dwattr $C$DW$74, DW_AT_decl_line(0xc4)
     957        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     958$C$DW$75        .dwtag  DW_TAG_member
     959        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     960        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU1")
     961        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU1")
     962        .dwattr $C$DW$75, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     963        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     965        .dwattr $C$DW$75, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     966        .dwattr $C$DW$75, DW_AT_decl_line(0xc5)
     967        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     968$C$DW$76        .dwtag  DW_TAG_member
     969        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     970        .dwattr $C$DW$76, DW_AT_name("rsvd2")
     971        .dwattr $C$DW$76, DW_AT_TI_symbol_name("rsvd2")
     972        .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     973        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     975        .dwattr $C$DW$76, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     976        .dwattr $C$DW$76, DW_AT_decl_line(0xc6)
     977        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     978        .dwendtag $C$DW$T$28
     979
     980        .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     981        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     982        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     983$C$DW$T$55      .dwtag  DW_TAG_volatile_type
     984        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
     985
     986$C$DW$T$29      .dwtag  DW_TAG_structure_type
     987        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     988$C$DW$77        .dwtag  DW_TAG_member
     989        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     990        .dwattr $C$DW$77, DW_AT_name("OCP_EN")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991        .dwattr $C$DW$77, DW_AT_TI_symbol_name("OCP_EN")
     992        .dwattr $C$DW$77, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     993        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     995        .dwattr $C$DW$77, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     996        .dwattr $C$DW$77, DW_AT_decl_line(0xd3)
     997        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     998$C$DW$78        .dwtag  DW_TAG_member
     999        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1000        .dwattr $C$DW$78, DW_AT_name("rsvd1")
    1001        .dwattr $C$DW$78, DW_AT_TI_symbol_name("rsvd1")
    1002        .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1003        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1005        .dwattr $C$DW$78, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1006        .dwattr $C$DW$78, DW_AT_decl_line(0xd4)
    1007        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1008        .dwendtag $C$DW$T$29
    1009
    1010        .dwattr $C$DW$T$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1011        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1012        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1013$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1014        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1015
    1016$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1017        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1018$C$DW$79        .dwtag  DW_TAG_member
    1019        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1020        .dwattr $C$DW$79, DW_AT_name("PRU1_PAD_HP_EN")
    1021        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1022        .dwattr $C$DW$79, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1023        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1025        .dwattr $C$DW$79, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1026        .dwattr $C$DW$79, DW_AT_decl_line(0xde)
    1027        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1028$C$DW$80        .dwtag  DW_TAG_member
    1029        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1030        .dwattr $C$DW$80, DW_AT_name("XFR_SHIFT_EN")
    1031        .dwattr $C$DW$80, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1032        .dwattr $C$DW$80, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1033        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1035        .dwattr $C$DW$80, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1036        .dwattr $C$DW$80, DW_AT_decl_line(0xdf)
    1037        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1038$C$DW$81        .dwtag  DW_TAG_member
    1039        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1040        .dwattr $C$DW$81, DW_AT_name("rsvd2")
    1041        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd2")
    1042        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1043        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1045        .dwattr $C$DW$81, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046        .dwattr $C$DW$81, DW_AT_decl_line(0xe0)
    1047        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1048        .dwendtag $C$DW$T$30
    1049
    1050        .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1051        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1052        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1053$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1054        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1055
    1056$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1057        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1058$C$DW$82        .dwtag  DW_TAG_member
    1059        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1060        .dwattr $C$DW$82, DW_AT_name("PIN_MUX_SEL")
    1061        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1062        .dwattr $C$DW$82, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1063        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1065        .dwattr $C$DW$82, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1066        .dwattr $C$DW$82, DW_AT_decl_line(0xec)
    1067        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1068$C$DW$83        .dwtag  DW_TAG_member
    1069        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1070        .dwattr $C$DW$83, DW_AT_name("rsvd2")
    1071        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd2")
    1072        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1073        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1075        .dwattr $C$DW$83, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1076        .dwattr $C$DW$83, DW_AT_decl_line(0xed)
    1077        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1078        .dwendtag $C$DW$T$31
    1079
    1080        .dwattr $C$DW$T$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1081        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1082        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1083$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1084        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1085
    1086$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1087        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1088$C$DW$84        .dwtag  DW_TAG_member
    1089        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$38)
    1090        .dwattr $C$DW$84, DW_AT_name("$P$T0")
    1091        .dwattr $C$DW$84, DW_AT_TI_symbol_name("$P$T0")
    1092        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1093        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1094        .dwattr $C$DW$84, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1095        .dwattr $C$DW$84, DW_AT_decl_line(0x29)
    1096        .dwattr $C$DW$84, DW_AT_decl_column(0x02)
    1097$C$DW$85        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$40)
    1099        .dwattr $C$DW$85, DW_AT_name("$P$T1")
    1100        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T1")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1102        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$85, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1104        .dwattr $C$DW$85, DW_AT_decl_line(0x33)
    1105        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1106$C$DW$86        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$42)
    1108        .dwattr $C$DW$86, DW_AT_name("$P$T2")
    1109        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T2")
    1110        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1111        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1112        .dwattr $C$DW$86, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1113        .dwattr $C$DW$86, DW_AT_decl_line(0x41)
    1114        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1115$C$DW$87        .dwtag  DW_TAG_member
    1116        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$44)
    1117        .dwattr $C$DW$87, DW_AT_name("$P$T3")
    1118        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T3")
    1119        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1120        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1121        .dwattr $C$DW$87, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1122        .dwattr $C$DW$87, DW_AT_decl_line(0x54)
    1123        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1124$C$DW$88        .dwtag  DW_TAG_member
    1125        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$46)
    1126        .dwattr $C$DW$88, DW_AT_name("$P$T4")
    1127        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T4")
    1128        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1129        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1130        .dwattr $C$DW$88, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1131        .dwattr $C$DW$88, DW_AT_decl_line(0x67)
    1132        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1133$C$DW$89        .dwtag  DW_TAG_member
    1134        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$48)
    1135        .dwattr $C$DW$89, DW_AT_name("$P$T5")
    1136        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T5")
    1137        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1138        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1139        .dwattr $C$DW$89, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1140        .dwattr $C$DW$89, DW_AT_decl_line(0x83)
    1141        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1142$C$DW$90        .dwtag  DW_TAG_member
    1143        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$50)
    1144        .dwattr $C$DW$90, DW_AT_name("$P$T6")
    1145        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T6")
    1146        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1147        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1148        .dwattr $C$DW$90, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1149        .dwattr $C$DW$90, DW_AT_decl_line(0x92)
    1150        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1151$C$DW$91        .dwtag  DW_TAG_member
    1152        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$52)
    1153        .dwattr $C$DW$91, DW_AT_name("$P$T7")
    1154        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T7")
    1155        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1157        .dwattr $C$DW$91, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1158        .dwattr $C$DW$91, DW_AT_decl_line(0xa0)
    1159        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1160$C$DW$92        .dwtag  DW_TAG_member
    1161        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$54)
    1162        .dwattr $C$DW$92, DW_AT_name("$P$T8")
    1163        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T8")
    1164        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1165        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$92, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1167        .dwattr $C$DW$92, DW_AT_decl_line(0xaf)
    1168        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1169$C$DW$93        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$32)
    1171        .dwattr $C$DW$93, DW_AT_name("rsvd24")
    1172        .dwattr $C$DW$93, DW_AT_TI_symbol_name("rsvd24")
    1173        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1174        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1175        .dwattr $C$DW$93, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1176        .dwattr $C$DW$93, DW_AT_decl_line(0xbc)
    1177        .dwattr $C$DW$93, DW_AT_decl_column(0x0b)
    1178$C$DW$94        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$56)
    1180        .dwattr $C$DW$94, DW_AT_name("$P$T9")
    1181        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T9")
    1182        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1183        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1184        .dwattr $C$DW$94, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1185        .dwattr $C$DW$94, DW_AT_decl_line(0xc0)
    1186        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1187$C$DW$95        .dwtag  DW_TAG_member
    1188        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$33)
    1189        .dwattr $C$DW$95, DW_AT_name("rsvd2c")
    1190        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd2c")
    1191        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1192        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$95, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1194        .dwattr $C$DW$95, DW_AT_decl_line(0xcb)
    1195        .dwattr $C$DW$95, DW_AT_decl_column(0x0b)
    1196$C$DW$96        .dwtag  DW_TAG_member
    1197        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$58)
    1198        .dwattr $C$DW$96, DW_AT_name("$P$T10")
    1199        .dwattr $C$DW$96, DW_AT_TI_symbol_name("$P$T10")
    1200        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1201        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$96, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1203        .dwattr $C$DW$96, DW_AT_decl_line(0xcf)
    1204        .dwattr $C$DW$96, DW_AT_decl_column(0x02)
    1205$C$DW$97        .dwtag  DW_TAG_member
    1206        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$60)
    1207        .dwattr $C$DW$97, DW_AT_name("$P$T11")
    1208        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T11")
    1209        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1210        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211        .dwattr $C$DW$97, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1212        .dwattr $C$DW$97, DW_AT_decl_line(0xda)
    1213        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1214$C$DW$98        .dwtag  DW_TAG_member
    1215        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
    1216        .dwattr $C$DW$98, DW_AT_name("rsvd38")
    1217        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd38")
    1218        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1219        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1220        .dwattr $C$DW$98, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1221        .dwattr $C$DW$98, DW_AT_decl_line(0xe5)
    1222        .dwattr $C$DW$98, DW_AT_decl_column(0x0b)
    1223$C$DW$99        .dwtag  DW_TAG_member
    1224        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$62)
    1225        .dwattr $C$DW$99, DW_AT_name("$P$T12")
    1226        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T12")
    1227        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1228        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1229        .dwattr $C$DW$99, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1230        .dwattr $C$DW$99, DW_AT_decl_line(0xe8)
    1231        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1232        .dwendtag $C$DW$T$35
    1233
    1234        .dwattr $C$DW$T$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1235        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1236        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1237$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1238        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1239        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1240        .dwattr $C$DW$T$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1241        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1242        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1243$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1244        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1245
    1246$C$DW$T$38      .dwtag  DW_TAG_union_type
    1247        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1248$C$DW$100       .dwtag  DW_TAG_member
    1249        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$36)
    1250        .dwattr $C$DW$100, DW_AT_name("REVID")
    1251        .dwattr $C$DW$100, DW_AT_TI_symbol_name("REVID")
    1252        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1254        .dwattr $C$DW$100, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1255        .dwattr $C$DW$100, DW_AT_decl_line(0x2a)
    1256        .dwattr $C$DW$100, DW_AT_decl_column(0x15)
    1257$C$DW$101       .dwtag  DW_TAG_member
    1258        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$37)
    1259        .dwattr $C$DW$101, DW_AT_name("REVID_bit")
    1260        .dwattr $C$DW$101, DW_AT_TI_symbol_name("REVID_bit")
    1261        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1263        .dwattr $C$DW$101, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1264        .dwattr $C$DW$101, DW_AT_decl_line(0x2e)
    1265        .dwattr $C$DW$101, DW_AT_decl_column(0x05)
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266        .dwendtag $C$DW$T$38
    1267
    1268        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1269        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1270        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1271
    1272$C$DW$T$40      .dwtag  DW_TAG_union_type
    1273        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1274$C$DW$102       .dwtag  DW_TAG_member
    1275        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$36)
    1276        .dwattr $C$DW$102, DW_AT_name("SYSCFG")
    1277        .dwattr $C$DW$102, DW_AT_TI_symbol_name("SYSCFG")
    1278        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1280        .dwattr $C$DW$102, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1281        .dwattr $C$DW$102, DW_AT_decl_line(0x34)
    1282        .dwattr $C$DW$102, DW_AT_decl_column(0x15)
    1283$C$DW$103       .dwtag  DW_TAG_member
    1284        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$39)
    1285        .dwattr $C$DW$103, DW_AT_name("SYSCFG_bit")
    1286        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SYSCFG_bit")
    1287        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1289        .dwattr $C$DW$103, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1290        .dwattr $C$DW$103, DW_AT_decl_line(0x3c)
    1291        .dwattr $C$DW$103, DW_AT_decl_column(0x05)
    1292        .dwendtag $C$DW$T$40
    1293
    1294        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1295        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1296        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1297
    1298$C$DW$T$42      .dwtag  DW_TAG_union_type
    1299        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1300$C$DW$104       .dwtag  DW_TAG_member
    1301        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$36)
    1302        .dwattr $C$DW$104, DW_AT_name("GPCFG0")
    1303        .dwattr $C$DW$104, DW_AT_TI_symbol_name("GPCFG0")
    1304        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1306        .dwattr $C$DW$104, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1307        .dwattr $C$DW$104, DW_AT_decl_line(0x42)
    1308        .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1309$C$DW$105       .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$41)
    1311        .dwattr $C$DW$105, DW_AT_name("GPCFG0_bit")
    1312        .dwattr $C$DW$105, DW_AT_TI_symbol_name("GPCFG0_bit")
    1313        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1315        .dwattr $C$DW$105, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1316        .dwattr $C$DW$105, DW_AT_decl_line(0x4f)
    1317        .dwattr $C$DW$105, DW_AT_decl_column(0x05)
    1318        .dwendtag $C$DW$T$42
    1319
    1320        .dwattr $C$DW$T$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1322        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1323
    1324$C$DW$T$44      .dwtag  DW_TAG_union_type
    1325        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1326$C$DW$106       .dwtag  DW_TAG_member
    1327        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$36)
    1328        .dwattr $C$DW$106, DW_AT_name("GPCFG1")
    1329        .dwattr $C$DW$106, DW_AT_TI_symbol_name("GPCFG1")
    1330        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1332        .dwattr $C$DW$106, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1333        .dwattr $C$DW$106, DW_AT_decl_line(0x55)
    1334        .dwattr $C$DW$106, DW_AT_decl_column(0x15)
    1335$C$DW$107       .dwtag  DW_TAG_member
    1336        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$43)
    1337        .dwattr $C$DW$107, DW_AT_name("GPCFG1_bit")
    1338        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG1_bit")
    1339        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1341        .dwattr $C$DW$107, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1342        .dwattr $C$DW$107, DW_AT_decl_line(0x62)
    1343        .dwattr $C$DW$107, DW_AT_decl_column(0x05)
    1344        .dwendtag $C$DW$T$44
    1345
    1346        .dwattr $C$DW$T$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1347        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1348        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1349
    1350$C$DW$T$46      .dwtag  DW_TAG_union_type
    1351        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1352$C$DW$108       .dwtag  DW_TAG_member
    1353        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$36)
    1354        .dwattr $C$DW$108, DW_AT_name("CGR")
    1355        .dwattr $C$DW$108, DW_AT_TI_symbol_name("CGR")
    1356        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1358        .dwattr $C$DW$108, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1359        .dwattr $C$DW$108, DW_AT_decl_line(0x68)
    1360        .dwattr $C$DW$108, DW_AT_decl_column(0x15)
    1361$C$DW$109       .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$45)
    1363        .dwattr $C$DW$109, DW_AT_name("CGR_bit")
    1364        .dwattr $C$DW$109, DW_AT_TI_symbol_name("CGR_bit")
    1365        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1367        .dwattr $C$DW$109, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1368        .dwattr $C$DW$109, DW_AT_decl_line(0x7e)
    1369        .dwattr $C$DW$109, DW_AT_decl_column(0x05)
    1370        .dwendtag $C$DW$T$46
    1371
    1372        .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1373        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1374        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1375
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376$C$DW$T$48      .dwtag  DW_TAG_union_type
    1377        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1378$C$DW$110       .dwtag  DW_TAG_member
    1379        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$36)
    1380        .dwattr $C$DW$110, DW_AT_name("ISRP")
    1381        .dwattr $C$DW$110, DW_AT_TI_symbol_name("ISRP")
    1382        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1384        .dwattr $C$DW$110, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1385        .dwattr $C$DW$110, DW_AT_decl_line(0x84)
    1386        .dwattr $C$DW$110, DW_AT_decl_column(0x15)
    1387$C$DW$111       .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$47)
    1389        .dwattr $C$DW$111, DW_AT_name("ISRP_bit")
    1390        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ISRP_bit")
    1391        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1393        .dwattr $C$DW$111, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1394        .dwattr $C$DW$111, DW_AT_decl_line(0x8d)
    1395        .dwattr $C$DW$111, DW_AT_decl_column(0x05)
    1396        .dwendtag $C$DW$T$48
    1397
    1398        .dwattr $C$DW$T$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1399        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1400        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1401
    1402$C$DW$T$50      .dwtag  DW_TAG_union_type
    1403        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1404$C$DW$112       .dwtag  DW_TAG_member
    1405        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$36)
    1406        .dwattr $C$DW$112, DW_AT_name("ISP")
    1407        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISP")
    1408        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1410        .dwattr $C$DW$112, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1411        .dwattr $C$DW$112, DW_AT_decl_line(0x93)
    1412        .dwattr $C$DW$112, DW_AT_decl_column(0x15)
    1413$C$DW$113       .dwtag  DW_TAG_member
    1414        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$49)
    1415        .dwattr $C$DW$113, DW_AT_name("ISP_bit")
    1416        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISP_bit")
    1417        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1419        .dwattr $C$DW$113, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1420        .dwattr $C$DW$113, DW_AT_decl_line(0x9c)
    1421        .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    1422        .dwendtag $C$DW$T$50
    1423
    1424        .dwattr $C$DW$T$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1425        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1426        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1427
    1428$C$DW$T$52      .dwtag  DW_TAG_union_type
    1429        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1430$C$DW$114       .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$36)
    1432        .dwattr $C$DW$114, DW_AT_name("IESP")
    1433        .dwattr $C$DW$114, DW_AT_TI_symbol_name("IESP")
    1434        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1436        .dwattr $C$DW$114, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1437        .dwattr $C$DW$114, DW_AT_decl_line(0xa1)
    1438        .dwattr $C$DW$114, DW_AT_decl_column(0x15)
    1439$C$DW$115       .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$51)
    1441        .dwattr $C$DW$115, DW_AT_name("IESP_bit")
    1442        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESP_bit")
    1443        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1445        .dwattr $C$DW$115, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1446        .dwattr $C$DW$115, DW_AT_decl_line(0xaa)
    1447        .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    1448        .dwendtag $C$DW$T$52
    1449
    1450        .dwattr $C$DW$T$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1451        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1452        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1453
    1454$C$DW$T$54      .dwtag  DW_TAG_union_type
    1455        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1456$C$DW$116       .dwtag  DW_TAG_member
    1457        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$36)
    1458        .dwattr $C$DW$116, DW_AT_name("IECP")
    1459        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IECP")
    1460        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1461        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1462        .dwattr $C$DW$116, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1463        .dwattr $C$DW$116, DW_AT_decl_line(0xb0)
    1464        .dwattr $C$DW$116, DW_AT_decl_column(0x15)
    1465$C$DW$117       .dwtag  DW_TAG_member
    1466        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$53)
    1467        .dwattr $C$DW$117, DW_AT_name("IECP_bit")
    1468        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IECP_bit")
    1469        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1471        .dwattr $C$DW$117, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1472        .dwattr $C$DW$117, DW_AT_decl_line(0xb8)
    1473        .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    1474        .dwendtag $C$DW$T$54
    1475
    1476        .dwattr $C$DW$T$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1477        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1478        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1479
    1480$C$DW$T$56      .dwtag  DW_TAG_union_type
    1481        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1482$C$DW$118       .dwtag  DW_TAG_member
    1483        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
    1484        .dwattr $C$DW$118, DW_AT_name("PMAO")
    1485        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PMAO")
PRU Assembler Unix v2.1.2 Tue Oct 25 14:20:18 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   28

    1486        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1488        .dwattr $C$DW$118, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1489        .dwattr $C$DW$118, DW_AT_decl_line(0xc1)
    1490        .dwattr $C$DW$118, DW_AT_decl_column(0x15)
    1491$C$DW$119       .dwtag  DW_TAG_member
    1492        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$55)
    1493        .dwattr $C$DW$119, DW_AT_name("PMAO_bit")
    1494        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PMAO_bit")
    1495        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1497        .dwattr $C$DW$119, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1498        .dwattr $C$DW$119, DW_AT_decl_line(0xc7)
    1499        .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    1500        .dwendtag $C$DW$T$56
    1501
    1502        .dwattr $C$DW$T$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1503        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1504        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1505
    1506$C$DW$T$58      .dwtag  DW_TAG_union_type
    1507        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1508$C$DW$120       .dwtag  DW_TAG_member
    1509        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$36)
    1510        .dwattr $C$DW$120, DW_AT_name("IEPCLK")
    1511        .dwattr $C$DW$120, DW_AT_TI_symbol_name("IEPCLK")
    1512        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1514        .dwattr $C$DW$120, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
