PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.2 *
       3;* Date/Time created: Tue Oct 25 01:17:16 2016                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.2 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/root/EmbeddedLinux/hw07/pru")
      12        .global __PRU_CREG_PRU_CFG
      13        .weak   ||CT_CFG||
      14 00000000                 ||CT_CFG||:     .usect  ".creg.PRU_CFG.noload.near",68,1
      15$C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("CT_CFG")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("CT_CFG")
      17        .dwattr $C$DW$1, DW_AT_location[DW_OP_addr ||CT_CFG||]
      18        .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$69)
      19        .dwattr $C$DW$1, DW_AT_external

      96;----------------------------------------------------------------------
      97
      98;***************************************************************
      99;* FNAME: main                          FR SIZE:   0           *
     100;*                                                             *
     101;* FUNCTION ENVIRONMENT                                        *
     102;*                                                             *
     103;* FUNCTION PROPERTIES                                         *
     104;*                            0 Auto,  0 SOE     *
     105;***************************************************************
     106
     107 00000000                 ||main||:
     108;* --------------------------------------------------------------------------*
     109        .dwcfi  cfa_offset, 0
     110        .dwpsn  file "main_pru0.c",line 59,column 2,is_stmt,isa 0
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111;----------------------------------------------------------------------
     112;  59 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
     113;  60 | while(1){                                                              
     114;----------------------------------------------------------------------
     115 00000000 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |59| CT_CFG
     116 00000004 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |59| 
     117 00000008 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |59| CT_CFG
     118;* --------------------------------------------------------------------------*
     119;*   BEGIN LOOP ||$C$L1||
     120;*
     121;*   Loop source line                : 61
     122;*   Loop closing brace source line  : 61
     123;*   Known Minimum Trip Count        : 1
     124;*   Known Maximum Trip Count        : 4294967295
     125;*   Known Max Trip Count Factor     : 1
     126;* --------------------------------------------------------------------------*
     127 0000000c                 ||$C$L1||:    
     128        .dwpsn  file "main_pru0.c",line 61,column 9,is_stmt,isa 0
     129;----------------------------------------------------------------------
     130;  61 | while(!(__R31&(1<<leader)));                                           
     131;----------------------------------------------------------------------
     132 0000000c 000000C910FF00          QBBC      ||$C$L1||, r31, 0x10  ; [ALU_PRU] |61| 
     133;* --------------------------------------------------------------------------*
     134        .dwpsn  file "main_pru0.c",line 62,column 3,is_stmt,isa 0
     135;----------------------------------------------------------------------
     136;  62 | __R30 ^= 1<<follower;                                                  
     137;----------------------------------------------------------------------
     138 00000010 0000001520FEFE          XOR       r30, r30, 0x20        ; [ALU_PRU] |62| 
     139;* --------------------------------------------------------------------------*
     140;*   BEGIN LOOP ||$C$L2||
     141;*
     142;*   Loop source line                : 63
     143;*   Loop closing brace source line  : 63
     144;*   Known Minimum Trip Count        : 1
     145;*   Known Maximum Trip Count        : 4294967295
     146;*   Known Max Trip Count Factor     : 1
     147;* --------------------------------------------------------------------------*
     148 00000014                 ||$C$L2||:    
     149        .dwpsn  file "main_pru0.c",line 63,column 3,is_stmt,isa 0
     150;----------------------------------------------------------------------
     151;  63 | while(__R31&(1<<leader));                                              
     152;----------------------------------------------------------------------
     153 00000014 000000D110FF00          QBBS      ||$C$L2||, r31, 0x10  ; [ALU_PRU] |63| 
     154;* --------------------------------------------------------------------------*
     155        .dwpsn  file "main_pru0.c",line 64,column 3,is_stmt,isa 0
     156;----------------------------------------------------------------------
     157;  64 | __R30 ^= 1<<follower;                                                  
     158;----------------------------------------------------------------------
     159 00000018 0000001520FEFE          XOR       r30, r30, 0x20        ; [ALU_PRU] |64| 
     160        .dwpsn  file "main_pru0.c",line 60,column 8,is_stmt,isa 0
     161 0000001c 00000021000000!         JMP       ||$C$L1||             ; [ALU_PRU] |60| 
     162;* --------------------------------------------------------------------------*
     163        .dwattr $C$DW$5, DW_AT_TI_end_file("main_pru0.c")
     164        .dwattr $C$DW$5, DW_AT_TI_end_line(0x42)
     165        .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166        .dwendentry
     167        .dwendtag $C$DW$5
     168
     169
     170;******************************************************************************
     171;* TYPE INFORMATION                                                           *
     172;******************************************************************************
     173
     174$C$DW$T$19      .dwtag  DW_TAG_structure_type
     175        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     176$C$DW$6 .dwtag  DW_TAG_member
     177        .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$11)
     178        .dwattr $C$DW$6, DW_AT_name("REVID")
     179        .dwattr $C$DW$6, DW_AT_TI_symbol_name("REVID")
     180        .dwattr $C$DW$6, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     181        .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     182        .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     183        .dwattr $C$DW$6, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     184        .dwattr $C$DW$6, DW_AT_decl_line(0x2d)
     185        .dwattr $C$DW$6, DW_AT_decl_column(0x0d)
     186        .dwendtag $C$DW$T$19
     187
     188        .dwattr $C$DW$T$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     189        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     190        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     191$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     192        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     193
     194$C$DW$T$20      .dwtag  DW_TAG_structure_type
     195        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     196$C$DW$7 .dwtag  DW_TAG_member
     197        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     198        .dwattr $C$DW$7, DW_AT_name("IDLE_MODE")
     199        .dwattr $C$DW$7, DW_AT_TI_symbol_name("IDLE_MODE")
     200        .dwattr $C$DW$7, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     201        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     202        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     203        .dwattr $C$DW$7, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     204        .dwattr $C$DW$7, DW_AT_decl_line(0x37)
     205        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     206$C$DW$8 .dwtag  DW_TAG_member
     207        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     208        .dwattr $C$DW$8, DW_AT_name("STANDBY_MODE")
     209        .dwattr $C$DW$8, DW_AT_TI_symbol_name("STANDBY_MODE")
     210        .dwattr $C$DW$8, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     211        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     212        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     213        .dwattr $C$DW$8, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     214        .dwattr $C$DW$8, DW_AT_decl_line(0x38)
     215        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     216$C$DW$9 .dwtag  DW_TAG_member
     217        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     218        .dwattr $C$DW$9, DW_AT_name("STANDBY_INIT")
     219        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_INIT")
     220        .dwattr $C$DW$9, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     222        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     223        .dwattr $C$DW$9, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru_
     224        .dwattr $C$DW$9, DW_AT_decl_line(0x39)
     225        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     226$C$DW$10        .dwtag  DW_TAG_member
     227        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     228        .dwattr $C$DW$10, DW_AT_name("SUB_MWAIT")
     229        .dwattr $C$DW$10, DW_AT_TI_symbol_name("SUB_MWAIT")
     230        .dwattr $C$DW$10, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     231        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     232        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     233        .dwattr $C$DW$10, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     234        .dwattr $C$DW$10, DW_AT_decl_line(0x3a)
     235        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     236$C$DW$11        .dwtag  DW_TAG_member
     237        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     238        .dwattr $C$DW$11, DW_AT_name("rsvd6")
     239        .dwattr $C$DW$11, DW_AT_TI_symbol_name("rsvd6")
     240        .dwattr $C$DW$11, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     241        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     242        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     243        .dwattr $C$DW$11, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     244        .dwattr $C$DW$11, DW_AT_decl_line(0x3b)
     245        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     246        .dwendtag $C$DW$T$20
     247
     248        .dwattr $C$DW$T$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     249        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     250        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     251$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     252        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     253
     254$C$DW$T$21      .dwtag  DW_TAG_structure_type
     255        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     256$C$DW$12        .dwtag  DW_TAG_member
     257        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     258        .dwattr $C$DW$12, DW_AT_name("PRU0_GPI_MODE")
     259        .dwattr $C$DW$12, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     260        .dwattr $C$DW$12, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     261        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     262        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     263        .dwattr $C$DW$12, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     264        .dwattr $C$DW$12, DW_AT_decl_line(0x45)
     265        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     266$C$DW$13        .dwtag  DW_TAG_member
     267        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     268        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_CLK_MODE")
     269        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     270        .dwattr $C$DW$13, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     271        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     272        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     273        .dwattr $C$DW$13, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     274        .dwattr $C$DW$13, DW_AT_decl_line(0x46)
     275        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276$C$DW$14        .dwtag  DW_TAG_member
     277        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     278        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_DIV0")
     279        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     280        .dwattr $C$DW$14, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     281        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     282        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     283        .dwattr $C$DW$14, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     284        .dwattr $C$DW$14, DW_AT_decl_line(0x47)
     285        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     286$C$DW$15        .dwtag  DW_TAG_member
     287        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     288        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV1")
     289        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     290        .dwattr $C$DW$15, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     291        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     292        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     293        .dwattr $C$DW$15, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     294        .dwattr $C$DW$15, DW_AT_decl_line(0x48)
     295        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     296$C$DW$16        .dwtag  DW_TAG_member
     297        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     298        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_SB")
     299        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     300        .dwattr $C$DW$16, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     301        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     302        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     303        .dwattr $C$DW$16, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     304        .dwattr $C$DW$16, DW_AT_decl_line(0x49)
     305        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     306$C$DW$17        .dwtag  DW_TAG_member
     307        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     308        .dwattr $C$DW$17, DW_AT_name("PRU0_GPO_MODE")
     309        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     310        .dwattr $C$DW$17, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     311        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     312        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     313        .dwattr $C$DW$17, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     314        .dwattr $C$DW$17, DW_AT_decl_line(0x4a)
     315        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     316$C$DW$18        .dwtag  DW_TAG_member
     317        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     318        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_DIV0")
     319        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     320        .dwattr $C$DW$18, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     321        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     322        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     323        .dwattr $C$DW$18, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     324        .dwattr $C$DW$18, DW_AT_decl_line(0x4b)
     325        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     326$C$DW$19        .dwtag  DW_TAG_member
     327        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     328        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV1")
     329        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     330        .dwattr $C$DW$19, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     332        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     333        .dwattr $C$DW$19, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     334        .dwattr $C$DW$19, DW_AT_decl_line(0x4c)
     335        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     336$C$DW$20        .dwtag  DW_TAG_member
     337        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     338        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_SH_SEL")
     339        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     340        .dwattr $C$DW$20, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     341        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     342        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     343        .dwattr $C$DW$20, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     344        .dwattr $C$DW$20, DW_AT_decl_line(0x4d)
     345        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     346$C$DW$21        .dwtag  DW_TAG_member
     347        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     348        .dwattr $C$DW$21, DW_AT_name("rsvd26")
     349        .dwattr $C$DW$21, DW_AT_TI_symbol_name("rsvd26")
     350        .dwattr $C$DW$21, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     351        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     352        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     353        .dwattr $C$DW$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     354        .dwattr $C$DW$21, DW_AT_decl_line(0x4e)
     355        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     356        .dwendtag $C$DW$T$21
     357
     358        .dwattr $C$DW$T$21, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     359        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     360        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     361$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     362        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     363
     364$C$DW$T$22      .dwtag  DW_TAG_structure_type
     365        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     366$C$DW$22        .dwtag  DW_TAG_member
     367        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     368        .dwattr $C$DW$22, DW_AT_name("PRU1_GPI_MODE")
     369        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     370        .dwattr $C$DW$22, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     371        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     372        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     373        .dwattr $C$DW$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     374        .dwattr $C$DW$22, DW_AT_decl_line(0x58)
     375        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     376$C$DW$23        .dwtag  DW_TAG_member
     377        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     378        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_CLK_MODE")
     379        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     380        .dwattr $C$DW$23, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     381        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     383        .dwattr $C$DW$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     384        .dwattr $C$DW$23, DW_AT_decl_line(0x59)
     385        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386$C$DW$24        .dwtag  DW_TAG_member
     387        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     388        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_DIV0")
     389        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     390        .dwattr $C$DW$24, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     391        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     392        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     393        .dwattr $C$DW$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     394        .dwattr $C$DW$24, DW_AT_decl_line(0x5a)
     395        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     396$C$DW$25        .dwtag  DW_TAG_member
     397        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     398        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV1")
     399        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     400        .dwattr $C$DW$25, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     401        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     403        .dwattr $C$DW$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     404        .dwattr $C$DW$25, DW_AT_decl_line(0x5b)
     405        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     406$C$DW$26        .dwtag  DW_TAG_member
     407        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     408        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_SB")
     409        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     410        .dwattr $C$DW$26, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     411        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     412        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     413        .dwattr $C$DW$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     414        .dwattr $C$DW$26, DW_AT_decl_line(0x5c)
     415        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     416$C$DW$27        .dwtag  DW_TAG_member
     417        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     418        .dwattr $C$DW$27, DW_AT_name("PRU1_GPO_MODE")
     419        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     420        .dwattr $C$DW$27, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     421        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     422        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     423        .dwattr $C$DW$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     424        .dwattr $C$DW$27, DW_AT_decl_line(0x5d)
     425        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     426$C$DW$28        .dwtag  DW_TAG_member
     427        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     428        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_DIV0")
     429        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     430        .dwattr $C$DW$28, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     431        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     432        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     433        .dwattr $C$DW$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     434        .dwattr $C$DW$28, DW_AT_decl_line(0x5e)
     435        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     436$C$DW$29        .dwtag  DW_TAG_member
     437        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     438        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV1")
     439        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     440        .dwattr $C$DW$29, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     442        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     443        .dwattr $C$DW$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     444        .dwattr $C$DW$29, DW_AT_decl_line(0x5f)
     445        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     446$C$DW$30        .dwtag  DW_TAG_member
     447        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     448        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_SH_SEL")
     449        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     450        .dwattr $C$DW$30, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     451        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     452        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     453        .dwattr $C$DW$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     454        .dwattr $C$DW$30, DW_AT_decl_line(0x60)
     455        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     456$C$DW$31        .dwtag  DW_TAG_member
     457        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     458        .dwattr $C$DW$31, DW_AT_name("rsvd26")
     459        .dwattr $C$DW$31, DW_AT_TI_symbol_name("rsvd26")
     460        .dwattr $C$DW$31, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     461        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     463        .dwattr $C$DW$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     464        .dwattr $C$DW$31, DW_AT_decl_line(0x61)
     465        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     466        .dwendtag $C$DW$T$22
     467
     468        .dwattr $C$DW$T$22, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     469        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     470        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     471$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     472        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     473
     474$C$DW$T$23      .dwtag  DW_TAG_structure_type
     475        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     476$C$DW$32        .dwtag  DW_TAG_member
     477        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     478        .dwattr $C$DW$32, DW_AT_name("PRU0_CLK_STOP_REQ")
     479        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     480        .dwattr $C$DW$32, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     481        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     482        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     483        .dwattr $C$DW$32, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     484        .dwattr $C$DW$32, DW_AT_decl_line(0x6b)
     485        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     486$C$DW$33        .dwtag  DW_TAG_member
     487        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     488        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_ACK")
     489        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     490        .dwattr $C$DW$33, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     491        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     493        .dwattr $C$DW$33, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     494        .dwattr $C$DW$33, DW_AT_decl_line(0x6c)
     495        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496$C$DW$34        .dwtag  DW_TAG_member
     497        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     498        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_EN")
     499        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     500        .dwattr $C$DW$34, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     501        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     502        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     503        .dwattr $C$DW$34, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     504        .dwattr $C$DW$34, DW_AT_decl_line(0x6d)
     505        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     506$C$DW$35        .dwtag  DW_TAG_member
     507        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     508        .dwattr $C$DW$35, DW_AT_name("PRU1_CLK_STOP_REQ")
     509        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     510        .dwattr $C$DW$35, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     511        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     513        .dwattr $C$DW$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     514        .dwattr $C$DW$35, DW_AT_decl_line(0x6e)
     515        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     516$C$DW$36        .dwtag  DW_TAG_member
     517        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     518        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_ACK")
     519        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     520        .dwattr $C$DW$36, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     521        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     523        .dwattr $C$DW$36, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     524        .dwattr $C$DW$36, DW_AT_decl_line(0x6f)
     525        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     526$C$DW$37        .dwtag  DW_TAG_member
     527        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     528        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_EN")
     529        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     530        .dwattr $C$DW$37, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     531        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     533        .dwattr $C$DW$37, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     534        .dwattr $C$DW$37, DW_AT_decl_line(0x70)
     535        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     536$C$DW$38        .dwtag  DW_TAG_member
     537        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     538        .dwattr $C$DW$38, DW_AT_name("INTC_CLK_STOP_REQ")
     539        .dwattr $C$DW$38, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     540        .dwattr $C$DW$38, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     541        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     543        .dwattr $C$DW$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     544        .dwattr $C$DW$38, DW_AT_decl_line(0x71)
     545        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     546$C$DW$39        .dwtag  DW_TAG_member
     547        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     548        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_ACK")
     549        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     550        .dwattr $C$DW$39, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     553        .dwattr $C$DW$39, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     554        .dwattr $C$DW$39, DW_AT_decl_line(0x72)
     555        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     556$C$DW$40        .dwtag  DW_TAG_member
     557        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     558        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_EN")
     559        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_EN")
     560        .dwattr $C$DW$40, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     561        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     563        .dwattr $C$DW$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     564        .dwattr $C$DW$40, DW_AT_decl_line(0x73)
     565        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     566$C$DW$41        .dwtag  DW_TAG_member
     567        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     568        .dwattr $C$DW$41, DW_AT_name("UART_CLK_STOP_REQ")
     569        .dwattr $C$DW$41, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     570        .dwattr $C$DW$41, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     571        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     573        .dwattr $C$DW$41, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     574        .dwattr $C$DW$41, DW_AT_decl_line(0x74)
     575        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     576$C$DW$42        .dwtag  DW_TAG_member
     577        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     578        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_ACK")
     579        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     580        .dwattr $C$DW$42, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     581        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     583        .dwattr $C$DW$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     584        .dwattr $C$DW$42, DW_AT_decl_line(0x75)
     585        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     586$C$DW$43        .dwtag  DW_TAG_member
     587        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     588        .dwattr $C$DW$43, DW_AT_name("UART_CLK_EN")
     589        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_EN")
     590        .dwattr $C$DW$43, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     591        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     593        .dwattr $C$DW$43, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     594        .dwattr $C$DW$43, DW_AT_decl_line(0x76)
     595        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     596$C$DW$44        .dwtag  DW_TAG_member
     597        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     598        .dwattr $C$DW$44, DW_AT_name("ECAP_CLK_STOP_REQ")
     599        .dwattr $C$DW$44, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     600        .dwattr $C$DW$44, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     601        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     603        .dwattr $C$DW$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     604        .dwattr $C$DW$44, DW_AT_decl_line(0x77)
     605        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606$C$DW$45        .dwtag  DW_TAG_member
     607        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     608        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_ACK")
     609        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     610        .dwattr $C$DW$45, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     611        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     613        .dwattr $C$DW$45, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     614        .dwattr $C$DW$45, DW_AT_decl_line(0x78)
     615        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     616$C$DW$46        .dwtag  DW_TAG_member
     617        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     618        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_EN")
     619        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     620        .dwattr $C$DW$46, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     621        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     623        .dwattr $C$DW$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     624        .dwattr $C$DW$46, DW_AT_decl_line(0x79)
     625        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     626$C$DW$47        .dwtag  DW_TAG_member
     627        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     628        .dwattr $C$DW$47, DW_AT_name("IEP_CLK_STOP_REQ")
     629        .dwattr $C$DW$47, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     630        .dwattr $C$DW$47, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     631        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     633        .dwattr $C$DW$47, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     634        .dwattr $C$DW$47, DW_AT_decl_line(0x7a)
     635        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     636$C$DW$48        .dwtag  DW_TAG_member
     637        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     638        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_ACK")
     639        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     640        .dwattr $C$DW$48, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     641        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     643        .dwattr $C$DW$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     644        .dwattr $C$DW$48, DW_AT_decl_line(0x7b)
     645        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     646$C$DW$49        .dwtag  DW_TAG_member
     647        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     648        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_EN")
     649        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_EN")
     650        .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     651        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     653        .dwattr $C$DW$49, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     654        .dwattr $C$DW$49, DW_AT_decl_line(0x7c)
     655        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     656$C$DW$50        .dwtag  DW_TAG_member
     657        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     658        .dwattr $C$DW$50, DW_AT_name("rsvd18")
     659        .dwattr $C$DW$50, DW_AT_TI_symbol_name("rsvd18")
     660        .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     663        .dwattr $C$DW$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     664        .dwattr $C$DW$50, DW_AT_decl_line(0x7d)
     665        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     666        .dwendtag $C$DW$T$23
     667
     668        .dwattr $C$DW$T$23, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     669        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     670        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     671$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     672        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     673
     674$C$DW$T$24      .dwtag  DW_TAG_structure_type
     675        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     676$C$DW$51        .dwtag  DW_TAG_member
     677        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     678        .dwattr $C$DW$51, DW_AT_name("PRU0_IMEM_PE_RAW")
     679        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     680        .dwattr $C$DW$51, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     681        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     683        .dwattr $C$DW$51, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     684        .dwattr $C$DW$51, DW_AT_decl_line(0x87)
     685        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     686$C$DW$52        .dwtag  DW_TAG_member
     687        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     688        .dwattr $C$DW$52, DW_AT_name("PRU0_DMEM_PE_RAW")
     689        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     690        .dwattr $C$DW$52, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     691        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     693        .dwattr $C$DW$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     694        .dwattr $C$DW$52, DW_AT_decl_line(0x88)
     695        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     696$C$DW$53        .dwtag  DW_TAG_member
     697        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     698        .dwattr $C$DW$53, DW_AT_name("PRU1_IMEM_PE_RAW")
     699        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     700        .dwattr $C$DW$53, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     701        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     703        .dwattr $C$DW$53, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     704        .dwattr $C$DW$53, DW_AT_decl_line(0x89)
     705        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     706$C$DW$54        .dwtag  DW_TAG_member
     707        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     708        .dwattr $C$DW$54, DW_AT_name("PRU1_DMEM_PE_RAW")
     709        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     710        .dwattr $C$DW$54, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     711        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     713        .dwattr $C$DW$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     714        .dwattr $C$DW$54, DW_AT_decl_line(0x8a)
     715        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716$C$DW$55        .dwtag  DW_TAG_member
     717        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     718        .dwattr $C$DW$55, DW_AT_name("RAM_PE_RAW")
     719        .dwattr $C$DW$55, DW_AT_TI_symbol_name("RAM_PE_RAW")
     720        .dwattr $C$DW$55, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     721        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     723        .dwattr $C$DW$55, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     724        .dwattr $C$DW$55, DW_AT_decl_line(0x8b)
     725        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     726$C$DW$56        .dwtag  DW_TAG_member
     727        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     728        .dwattr $C$DW$56, DW_AT_name("rsvd20")
     729        .dwattr $C$DW$56, DW_AT_TI_symbol_name("rsvd20")
     730        .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     731        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     733        .dwattr $C$DW$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     734        .dwattr $C$DW$56, DW_AT_decl_line(0x8c)
     735        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     736        .dwendtag $C$DW$T$24
     737
     738        .dwattr $C$DW$T$24, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     739        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     740        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     741$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     742        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     743
     744$C$DW$T$25      .dwtag  DW_TAG_structure_type
     745        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     746$C$DW$57        .dwtag  DW_TAG_member
     747        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     748        .dwattr $C$DW$57, DW_AT_name("PRU0_IMEM_PE")
     749        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     750        .dwattr $C$DW$57, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     751        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     753        .dwattr $C$DW$57, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     754        .dwattr $C$DW$57, DW_AT_decl_line(0x96)
     755        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     756$C$DW$58        .dwtag  DW_TAG_member
     757        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     758        .dwattr $C$DW$58, DW_AT_name("PRU0_DMEM_PE")
     759        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     760        .dwattr $C$DW$58, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     761        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     763        .dwattr $C$DW$58, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     764        .dwattr $C$DW$58, DW_AT_decl_line(0x97)
     765        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     766$C$DW$59        .dwtag  DW_TAG_member
     767        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     768        .dwattr $C$DW$59, DW_AT_name("PRU1_IMEM_PE")
     769        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     770        .dwattr $C$DW$59, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     773        .dwattr $C$DW$59, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     774        .dwattr $C$DW$59, DW_AT_decl_line(0x98)
     775        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     776$C$DW$60        .dwtag  DW_TAG_member
     777        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     778        .dwattr $C$DW$60, DW_AT_name("PRU1_DMEM_PE")
     779        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     780        .dwattr $C$DW$60, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     781        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     783        .dwattr $C$DW$60, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     784        .dwattr $C$DW$60, DW_AT_decl_line(0x99)
     785        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     786$C$DW$61        .dwtag  DW_TAG_member
     787        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     788        .dwattr $C$DW$61, DW_AT_name("RAM_PE")
     789        .dwattr $C$DW$61, DW_AT_TI_symbol_name("RAM_PE")
     790        .dwattr $C$DW$61, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     791        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     793        .dwattr $C$DW$61, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     794        .dwattr $C$DW$61, DW_AT_decl_line(0x9a)
     795        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     796$C$DW$62        .dwtag  DW_TAG_member
     797        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     798        .dwattr $C$DW$62, DW_AT_name("rsvd20")
     799        .dwattr $C$DW$62, DW_AT_TI_symbol_name("rsvd20")
     800        .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     801        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     803        .dwattr $C$DW$62, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     804        .dwattr $C$DW$62, DW_AT_decl_line(0x9b)
     805        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     806        .dwendtag $C$DW$T$25
     807
     808        .dwattr $C$DW$T$25, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     809        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     810        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     811$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     812        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     813
     814$C$DW$T$26      .dwtag  DW_TAG_structure_type
     815        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     816$C$DW$63        .dwtag  DW_TAG_member
     817        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     818        .dwattr $C$DW$63, DW_AT_name("PRU0_IMEM_PE_SET")
     819        .dwattr $C$DW$63, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     820        .dwattr $C$DW$63, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     821        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     823        .dwattr $C$DW$63, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     824        .dwattr $C$DW$63, DW_AT_decl_line(0xa4)
     825        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826$C$DW$64        .dwtag  DW_TAG_member
     827        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     828        .dwattr $C$DW$64, DW_AT_name("PRU0_DMEM_PE_SET")
     829        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     830        .dwattr $C$DW$64, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     831        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     833        .dwattr $C$DW$64, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     834        .dwattr $C$DW$64, DW_AT_decl_line(0xa5)
     835        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     836$C$DW$65        .dwtag  DW_TAG_member
     837        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     838        .dwattr $C$DW$65, DW_AT_name("PRU1_IMEM_PE_SET")
     839        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     840        .dwattr $C$DW$65, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     841        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     843        .dwattr $C$DW$65, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     844        .dwattr $C$DW$65, DW_AT_decl_line(0xa6)
     845        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     846$C$DW$66        .dwtag  DW_TAG_member
     847        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     848        .dwattr $C$DW$66, DW_AT_name("PRU1_DMEM_PE_SET")
     849        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     850        .dwattr $C$DW$66, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     851        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     853        .dwattr $C$DW$66, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     854        .dwattr $C$DW$66, DW_AT_decl_line(0xa7)
     855        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     856$C$DW$67        .dwtag  DW_TAG_member
     857        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     858        .dwattr $C$DW$67, DW_AT_name("RAM_PE_SET")
     859        .dwattr $C$DW$67, DW_AT_TI_symbol_name("RAM_PE_SET")
     860        .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     861        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     863        .dwattr $C$DW$67, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     864        .dwattr $C$DW$67, DW_AT_decl_line(0xa8)
     865        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     866$C$DW$68        .dwtag  DW_TAG_member
     867        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     868        .dwattr $C$DW$68, DW_AT_name("rsvd20")
     869        .dwattr $C$DW$68, DW_AT_TI_symbol_name("rsvd20")
     870        .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     871        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     873        .dwattr $C$DW$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     874        .dwattr $C$DW$68, DW_AT_decl_line(0xa9)
     875        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     876        .dwendtag $C$DW$T$26
     877
     878        .dwattr $C$DW$T$26, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     879        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     880        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     882        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
     883
     884$C$DW$T$27      .dwtag  DW_TAG_structure_type
     885        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     886$C$DW$69        .dwtag  DW_TAG_member
     887        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     888        .dwattr $C$DW$69, DW_AT_name("PRU0_IMEM_PE_CLR")
     889        .dwattr $C$DW$69, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     890        .dwattr $C$DW$69, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     891        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     893        .dwattr $C$DW$69, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     894        .dwattr $C$DW$69, DW_AT_decl_line(0xb3)
     895        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     896$C$DW$70        .dwtag  DW_TAG_member
     897        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     898        .dwattr $C$DW$70, DW_AT_name("PRU0_DMEM_PE_CLR")
     899        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     900        .dwattr $C$DW$70, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     901        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     903        .dwattr $C$DW$70, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     904        .dwattr $C$DW$70, DW_AT_decl_line(0xb4)
     905        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     906$C$DW$71        .dwtag  DW_TAG_member
     907        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     908        .dwattr $C$DW$71, DW_AT_name("PRU1_IMEM_PE_CLR")
     909        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     910        .dwattr $C$DW$71, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     911        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     913        .dwattr $C$DW$71, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     914        .dwattr $C$DW$71, DW_AT_decl_line(0xb5)
     915        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     916$C$DW$72        .dwtag  DW_TAG_member
     917        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     918        .dwattr $C$DW$72, DW_AT_name("PRU1_DMEM_PE_CLR")
     919        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     920        .dwattr $C$DW$72, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     921        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     923        .dwattr $C$DW$72, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     924        .dwattr $C$DW$72, DW_AT_decl_line(0xb6)
     925        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     926$C$DW$73        .dwtag  DW_TAG_member
     927        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     928        .dwattr $C$DW$73, DW_AT_name("rsvd16")
     929        .dwattr $C$DW$73, DW_AT_TI_symbol_name("rsvd16")
     930        .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     931        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     933        .dwattr $C$DW$73, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     934        .dwattr $C$DW$73, DW_AT_decl_line(0xb7)
     935        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwendtag $C$DW$T$27
     937
     938        .dwattr $C$DW$T$27, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     939        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     940        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     941$C$DW$T$53      .dwtag  DW_TAG_volatile_type
     942        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     943
     944$C$DW$T$28      .dwtag  DW_TAG_structure_type
     945        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     946$C$DW$74        .dwtag  DW_TAG_member
     947        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     948        .dwattr $C$DW$74, DW_AT_name("PMAO_PRU0")
     949        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PMAO_PRU0")
     950        .dwattr $C$DW$74, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     951        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     953        .dwattr $C$DW$74, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     954        .dwattr $C$DW$74, DW_AT_decl_line(0xc4)
     955        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     956$C$DW$75        .dwtag  DW_TAG_member
     957        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     958        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU1")
     959        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU1")
     960        .dwattr $C$DW$75, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     961        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     963        .dwattr $C$DW$75, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     964        .dwattr $C$DW$75, DW_AT_decl_line(0xc5)
     965        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     966$C$DW$76        .dwtag  DW_TAG_member
     967        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     968        .dwattr $C$DW$76, DW_AT_name("rsvd2")
     969        .dwattr $C$DW$76, DW_AT_TI_symbol_name("rsvd2")
     970        .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     971        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     973        .dwattr $C$DW$76, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     974        .dwattr $C$DW$76, DW_AT_decl_line(0xc6)
     975        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     976        .dwendtag $C$DW$T$28
     977
     978        .dwattr $C$DW$T$28, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
     979        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     980        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     981$C$DW$T$55      .dwtag  DW_TAG_volatile_type
     982        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
     983
     984$C$DW$T$29      .dwtag  DW_TAG_structure_type
     985        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     986$C$DW$77        .dwtag  DW_TAG_member
     987        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     988        .dwattr $C$DW$77, DW_AT_name("OCP_EN")
     989        .dwattr $C$DW$77, DW_AT_TI_symbol_name("OCP_EN")
     990        .dwattr $C$DW$77, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     993        .dwattr $C$DW$77, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
     994        .dwattr $C$DW$77, DW_AT_decl_line(0xd3)
     995        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     996$C$DW$78        .dwtag  DW_TAG_member
     997        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     998        .dwattr $C$DW$78, DW_AT_name("rsvd1")
     999        .dwattr $C$DW$78, DW_AT_TI_symbol_name("rsvd1")
    1000        .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1001        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1003        .dwattr $C$DW$78, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1004        .dwattr $C$DW$78, DW_AT_decl_line(0xd4)
    1005        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1006        .dwendtag $C$DW$T$29
    1007
    1008        .dwattr $C$DW$T$29, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1009        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1010        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1011$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1012        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1013
    1014$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1015        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1016$C$DW$79        .dwtag  DW_TAG_member
    1017        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1018        .dwattr $C$DW$79, DW_AT_name("PRU1_PAD_HP_EN")
    1019        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1020        .dwattr $C$DW$79, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1021        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1023        .dwattr $C$DW$79, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1024        .dwattr $C$DW$79, DW_AT_decl_line(0xde)
    1025        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1026$C$DW$80        .dwtag  DW_TAG_member
    1027        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1028        .dwattr $C$DW$80, DW_AT_name("XFR_SHIFT_EN")
    1029        .dwattr $C$DW$80, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1030        .dwattr $C$DW$80, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1031        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1033        .dwattr $C$DW$80, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1034        .dwattr $C$DW$80, DW_AT_decl_line(0xdf)
    1035        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1036$C$DW$81        .dwtag  DW_TAG_member
    1037        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1038        .dwattr $C$DW$81, DW_AT_name("rsvd2")
    1039        .dwattr $C$DW$81, DW_AT_TI_symbol_name("rsvd2")
    1040        .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1041        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1043        .dwattr $C$DW$81, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1044        .dwattr $C$DW$81, DW_AT_decl_line(0xe0)
    1045        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046        .dwendtag $C$DW$T$30
    1047
    1048        .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1049        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1050        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1051$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1052        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1053
    1054$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1055        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1056$C$DW$82        .dwtag  DW_TAG_member
    1057        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1058        .dwattr $C$DW$82, DW_AT_name("PIN_MUX_SEL")
    1059        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1060        .dwattr $C$DW$82, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1061        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1063        .dwattr $C$DW$82, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1064        .dwattr $C$DW$82, DW_AT_decl_line(0xec)
    1065        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1066$C$DW$83        .dwtag  DW_TAG_member
    1067        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1068        .dwattr $C$DW$83, DW_AT_name("rsvd2")
    1069        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd2")
    1070        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1071        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1073        .dwattr $C$DW$83, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1074        .dwattr $C$DW$83, DW_AT_decl_line(0xed)
    1075        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1076        .dwendtag $C$DW$T$31
    1077
    1078        .dwattr $C$DW$T$31, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1079        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1080        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1081$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1082        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1083
    1084$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1085        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1086$C$DW$84        .dwtag  DW_TAG_member
    1087        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$38)
    1088        .dwattr $C$DW$84, DW_AT_name("$P$T0")
    1089        .dwattr $C$DW$84, DW_AT_TI_symbol_name("$P$T0")
    1090        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1092        .dwattr $C$DW$84, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1093        .dwattr $C$DW$84, DW_AT_decl_line(0x29)
    1094        .dwattr $C$DW$84, DW_AT_decl_column(0x02)
    1095$C$DW$85        .dwtag  DW_TAG_member
    1096        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$40)
    1097        .dwattr $C$DW$85, DW_AT_name("$P$T1")
    1098        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T1")
    1099        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1100        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$85, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1102        .dwattr $C$DW$85, DW_AT_decl_line(0x33)
    1103        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1104$C$DW$86        .dwtag  DW_TAG_member
    1105        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$42)
    1106        .dwattr $C$DW$86, DW_AT_name("$P$T2")
    1107        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T2")
    1108        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1109        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1110        .dwattr $C$DW$86, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1111        .dwattr $C$DW$86, DW_AT_decl_line(0x41)
    1112        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1113$C$DW$87        .dwtag  DW_TAG_member
    1114        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$44)
    1115        .dwattr $C$DW$87, DW_AT_name("$P$T3")
    1116        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T3")
    1117        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1118        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1119        .dwattr $C$DW$87, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1120        .dwattr $C$DW$87, DW_AT_decl_line(0x54)
    1121        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1122$C$DW$88        .dwtag  DW_TAG_member
    1123        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$46)
    1124        .dwattr $C$DW$88, DW_AT_name("$P$T4")
    1125        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T4")
    1126        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1127        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1128        .dwattr $C$DW$88, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1129        .dwattr $C$DW$88, DW_AT_decl_line(0x67)
    1130        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1131$C$DW$89        .dwtag  DW_TAG_member
    1132        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$48)
    1133        .dwattr $C$DW$89, DW_AT_name("$P$T5")
    1134        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T5")
    1135        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1136        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1137        .dwattr $C$DW$89, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1138        .dwattr $C$DW$89, DW_AT_decl_line(0x83)
    1139        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1140$C$DW$90        .dwtag  DW_TAG_member
    1141        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$50)
    1142        .dwattr $C$DW$90, DW_AT_name("$P$T6")
    1143        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T6")
    1144        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1145        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1146        .dwattr $C$DW$90, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1147        .dwattr $C$DW$90, DW_AT_decl_line(0x92)
    1148        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1149$C$DW$91        .dwtag  DW_TAG_member
    1150        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$52)
    1151        .dwattr $C$DW$91, DW_AT_name("$P$T7")
    1152        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T7")
    1153        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1154        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1155        .dwattr $C$DW$91, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156        .dwattr $C$DW$91, DW_AT_decl_line(0xa0)
    1157        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1158$C$DW$92        .dwtag  DW_TAG_member
    1159        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$54)
    1160        .dwattr $C$DW$92, DW_AT_name("$P$T8")
    1161        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T8")
    1162        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1163        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1164        .dwattr $C$DW$92, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1165        .dwattr $C$DW$92, DW_AT_decl_line(0xaf)
    1166        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1167$C$DW$93        .dwtag  DW_TAG_member
    1168        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$32)
    1169        .dwattr $C$DW$93, DW_AT_name("rsvd24")
    1170        .dwattr $C$DW$93, DW_AT_TI_symbol_name("rsvd24")
    1171        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1172        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1173        .dwattr $C$DW$93, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1174        .dwattr $C$DW$93, DW_AT_decl_line(0xbc)
    1175        .dwattr $C$DW$93, DW_AT_decl_column(0x0b)
    1176$C$DW$94        .dwtag  DW_TAG_member
    1177        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$56)
    1178        .dwattr $C$DW$94, DW_AT_name("$P$T9")
    1179        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T9")
    1180        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1181        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1182        .dwattr $C$DW$94, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1183        .dwattr $C$DW$94, DW_AT_decl_line(0xc0)
    1184        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1185$C$DW$95        .dwtag  DW_TAG_member
    1186        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$33)
    1187        .dwattr $C$DW$95, DW_AT_name("rsvd2c")
    1188        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd2c")
    1189        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1190        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1191        .dwattr $C$DW$95, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1192        .dwattr $C$DW$95, DW_AT_decl_line(0xcb)
    1193        .dwattr $C$DW$95, DW_AT_decl_column(0x0b)
    1194$C$DW$96        .dwtag  DW_TAG_member
    1195        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$58)
    1196        .dwattr $C$DW$96, DW_AT_name("$P$T10")
    1197        .dwattr $C$DW$96, DW_AT_TI_symbol_name("$P$T10")
    1198        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1199        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1200        .dwattr $C$DW$96, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1201        .dwattr $C$DW$96, DW_AT_decl_line(0xcf)
    1202        .dwattr $C$DW$96, DW_AT_decl_column(0x02)
    1203$C$DW$97        .dwtag  DW_TAG_member
    1204        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$60)
    1205        .dwattr $C$DW$97, DW_AT_name("$P$T11")
    1206        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T11")
    1207        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1208        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1209        .dwattr $C$DW$97, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1210        .dwattr $C$DW$97, DW_AT_decl_line(0xda)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1212$C$DW$98        .dwtag  DW_TAG_member
    1213        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
    1214        .dwattr $C$DW$98, DW_AT_name("rsvd38")
    1215        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd38")
    1216        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1217        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1218        .dwattr $C$DW$98, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1219        .dwattr $C$DW$98, DW_AT_decl_line(0xe5)
    1220        .dwattr $C$DW$98, DW_AT_decl_column(0x0b)
    1221$C$DW$99        .dwtag  DW_TAG_member
    1222        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$62)
    1223        .dwattr $C$DW$99, DW_AT_name("$P$T12")
    1224        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T12")
    1225        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1226        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1227        .dwattr $C$DW$99, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pru
    1228        .dwattr $C$DW$99, DW_AT_decl_line(0xe8)
    1229        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1230        .dwendtag $C$DW$T$35
    1231
    1232        .dwattr $C$DW$T$35, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1233        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1234        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1235$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1236        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1237        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1238        .dwattr $C$DW$T$68, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1239        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1240        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1241$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1242        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1243
    1244$C$DW$T$38      .dwtag  DW_TAG_union_type
    1245        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1246$C$DW$100       .dwtag  DW_TAG_member
    1247        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$36)
    1248        .dwattr $C$DW$100, DW_AT_name("REVID")
    1249        .dwattr $C$DW$100, DW_AT_TI_symbol_name("REVID")
    1250        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1252        .dwattr $C$DW$100, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1253        .dwattr $C$DW$100, DW_AT_decl_line(0x2a)
    1254        .dwattr $C$DW$100, DW_AT_decl_column(0x15)
    1255$C$DW$101       .dwtag  DW_TAG_member
    1256        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$37)
    1257        .dwattr $C$DW$101, DW_AT_name("REVID_bit")
    1258        .dwattr $C$DW$101, DW_AT_TI_symbol_name("REVID_bit")
    1259        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1261        .dwattr $C$DW$101, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1262        .dwattr $C$DW$101, DW_AT_decl_line(0x2e)
    1263        .dwattr $C$DW$101, DW_AT_decl_column(0x05)
    1264        .dwendtag $C$DW$T$38
    1265
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266        .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1267        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1268        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1269
    1270$C$DW$T$40      .dwtag  DW_TAG_union_type
    1271        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1272$C$DW$102       .dwtag  DW_TAG_member
    1273        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$36)
    1274        .dwattr $C$DW$102, DW_AT_name("SYSCFG")
    1275        .dwattr $C$DW$102, DW_AT_TI_symbol_name("SYSCFG")
    1276        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1278        .dwattr $C$DW$102, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1279        .dwattr $C$DW$102, DW_AT_decl_line(0x34)
    1280        .dwattr $C$DW$102, DW_AT_decl_column(0x15)
    1281$C$DW$103       .dwtag  DW_TAG_member
    1282        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$39)
    1283        .dwattr $C$DW$103, DW_AT_name("SYSCFG_bit")
    1284        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SYSCFG_bit")
    1285        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1287        .dwattr $C$DW$103, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1288        .dwattr $C$DW$103, DW_AT_decl_line(0x3c)
    1289        .dwattr $C$DW$103, DW_AT_decl_column(0x05)
    1290        .dwendtag $C$DW$T$40
    1291
    1292        .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1293        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1294        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1295
    1296$C$DW$T$42      .dwtag  DW_TAG_union_type
    1297        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1298$C$DW$104       .dwtag  DW_TAG_member
    1299        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$36)
    1300        .dwattr $C$DW$104, DW_AT_name("GPCFG0")
    1301        .dwattr $C$DW$104, DW_AT_TI_symbol_name("GPCFG0")
    1302        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1303        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1304        .dwattr $C$DW$104, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1305        .dwattr $C$DW$104, DW_AT_decl_line(0x42)
    1306        .dwattr $C$DW$104, DW_AT_decl_column(0x15)
    1307$C$DW$105       .dwtag  DW_TAG_member
    1308        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$41)
    1309        .dwattr $C$DW$105, DW_AT_name("GPCFG0_bit")
    1310        .dwattr $C$DW$105, DW_AT_TI_symbol_name("GPCFG0_bit")
    1311        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1313        .dwattr $C$DW$105, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1314        .dwattr $C$DW$105, DW_AT_decl_line(0x4f)
    1315        .dwattr $C$DW$105, DW_AT_decl_column(0x05)
    1316        .dwendtag $C$DW$T$42
    1317
    1318        .dwattr $C$DW$T$42, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1319        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1320        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321
    1322$C$DW$T$44      .dwtag  DW_TAG_union_type
    1323        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1324$C$DW$106       .dwtag  DW_TAG_member
    1325        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$36)
    1326        .dwattr $C$DW$106, DW_AT_name("GPCFG1")
    1327        .dwattr $C$DW$106, DW_AT_TI_symbol_name("GPCFG1")
    1328        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1329        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1330        .dwattr $C$DW$106, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1331        .dwattr $C$DW$106, DW_AT_decl_line(0x55)
    1332        .dwattr $C$DW$106, DW_AT_decl_column(0x15)
    1333$C$DW$107       .dwtag  DW_TAG_member
    1334        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$43)
    1335        .dwattr $C$DW$107, DW_AT_name("GPCFG1_bit")
    1336        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG1_bit")
    1337        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1339        .dwattr $C$DW$107, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1340        .dwattr $C$DW$107, DW_AT_decl_line(0x62)
    1341        .dwattr $C$DW$107, DW_AT_decl_column(0x05)
    1342        .dwendtag $C$DW$T$44
    1343
    1344        .dwattr $C$DW$T$44, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1345        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1346        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1347
    1348$C$DW$T$46      .dwtag  DW_TAG_union_type
    1349        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1350$C$DW$108       .dwtag  DW_TAG_member
    1351        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$36)
    1352        .dwattr $C$DW$108, DW_AT_name("CGR")
    1353        .dwattr $C$DW$108, DW_AT_TI_symbol_name("CGR")
    1354        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1356        .dwattr $C$DW$108, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1357        .dwattr $C$DW$108, DW_AT_decl_line(0x68)
    1358        .dwattr $C$DW$108, DW_AT_decl_column(0x15)
    1359$C$DW$109       .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$45)
    1361        .dwattr $C$DW$109, DW_AT_name("CGR_bit")
    1362        .dwattr $C$DW$109, DW_AT_TI_symbol_name("CGR_bit")
    1363        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1364        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1365        .dwattr $C$DW$109, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1366        .dwattr $C$DW$109, DW_AT_decl_line(0x7e)
    1367        .dwattr $C$DW$109, DW_AT_decl_column(0x05)
    1368        .dwendtag $C$DW$T$46
    1369
    1370        .dwattr $C$DW$T$46, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1371        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1372        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1373
    1374$C$DW$T$48      .dwtag  DW_TAG_union_type
    1375        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376$C$DW$110       .dwtag  DW_TAG_member
    1377        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$36)
    1378        .dwattr $C$DW$110, DW_AT_name("ISRP")
    1379        .dwattr $C$DW$110, DW_AT_TI_symbol_name("ISRP")
    1380        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1382        .dwattr $C$DW$110, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1383        .dwattr $C$DW$110, DW_AT_decl_line(0x84)
    1384        .dwattr $C$DW$110, DW_AT_decl_column(0x15)
    1385$C$DW$111       .dwtag  DW_TAG_member
    1386        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$47)
    1387        .dwattr $C$DW$111, DW_AT_name("ISRP_bit")
    1388        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ISRP_bit")
    1389        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1391        .dwattr $C$DW$111, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1392        .dwattr $C$DW$111, DW_AT_decl_line(0x8d)
    1393        .dwattr $C$DW$111, DW_AT_decl_column(0x05)
    1394        .dwendtag $C$DW$T$48
    1395
    1396        .dwattr $C$DW$T$48, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1397        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1398        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1399
    1400$C$DW$T$50      .dwtag  DW_TAG_union_type
    1401        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1402$C$DW$112       .dwtag  DW_TAG_member
    1403        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$36)
    1404        .dwattr $C$DW$112, DW_AT_name("ISP")
    1405        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISP")
    1406        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$112, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1409        .dwattr $C$DW$112, DW_AT_decl_line(0x93)
    1410        .dwattr $C$DW$112, DW_AT_decl_column(0x15)
    1411$C$DW$113       .dwtag  DW_TAG_member
    1412        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$49)
    1413        .dwattr $C$DW$113, DW_AT_name("ISP_bit")
    1414        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISP_bit")
    1415        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1417        .dwattr $C$DW$113, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1418        .dwattr $C$DW$113, DW_AT_decl_line(0x9c)
    1419        .dwattr $C$DW$113, DW_AT_decl_column(0x05)
    1420        .dwendtag $C$DW$T$50
    1421
    1422        .dwattr $C$DW$T$50, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1423        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1424        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1425
    1426$C$DW$T$52      .dwtag  DW_TAG_union_type
    1427        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1428$C$DW$114       .dwtag  DW_TAG_member
    1429        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$36)
    1430        .dwattr $C$DW$114, DW_AT_name("IESP")
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431        .dwattr $C$DW$114, DW_AT_TI_symbol_name("IESP")
    1432        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1434        .dwattr $C$DW$114, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1435        .dwattr $C$DW$114, DW_AT_decl_line(0xa1)
    1436        .dwattr $C$DW$114, DW_AT_decl_column(0x15)
    1437$C$DW$115       .dwtag  DW_TAG_member
    1438        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$51)
    1439        .dwattr $C$DW$115, DW_AT_name("IESP_bit")
    1440        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESP_bit")
    1441        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1443        .dwattr $C$DW$115, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1444        .dwattr $C$DW$115, DW_AT_decl_line(0xaa)
    1445        .dwattr $C$DW$115, DW_AT_decl_column(0x05)
    1446        .dwendtag $C$DW$T$52
    1447
    1448        .dwattr $C$DW$T$52, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1449        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1450        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1451
    1452$C$DW$T$54      .dwtag  DW_TAG_union_type
    1453        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1454$C$DW$116       .dwtag  DW_TAG_member
    1455        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$36)
    1456        .dwattr $C$DW$116, DW_AT_name("IECP")
    1457        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IECP")
    1458        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1460        .dwattr $C$DW$116, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1461        .dwattr $C$DW$116, DW_AT_decl_line(0xb0)
    1462        .dwattr $C$DW$116, DW_AT_decl_column(0x15)
    1463$C$DW$117       .dwtag  DW_TAG_member
    1464        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$53)
    1465        .dwattr $C$DW$117, DW_AT_name("IECP_bit")
    1466        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IECP_bit")
    1467        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1469        .dwattr $C$DW$117, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1470        .dwattr $C$DW$117, DW_AT_decl_line(0xb8)
    1471        .dwattr $C$DW$117, DW_AT_decl_column(0x05)
    1472        .dwendtag $C$DW$T$54
    1473
    1474        .dwattr $C$DW$T$54, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1475        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1476        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1477
    1478$C$DW$T$56      .dwtag  DW_TAG_union_type
    1479        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1480$C$DW$118       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
    1482        .dwattr $C$DW$118, DW_AT_name("PMAO")
    1483        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PMAO")
    1484        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.2 Tue Oct 25 01:17:17 2016

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   28

    1486        .dwattr $C$DW$118, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$118, DW_AT_decl_line(0xc1)
    1488        .dwattr $C$DW$118, DW_AT_decl_column(0x15)
    1489$C$DW$119       .dwtag  DW_TAG_member
    1490        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$55)
    1491        .dwattr $C$DW$119, DW_AT_name("PMAO_bit")
    1492        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PMAO_bit")
    1493        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$119, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/pr
    1496        .dwattr $C$DW$119, DW_AT_decl_line(0xc7)
    1497        .dwattr $C$DW$119, DW_AT_decl_column(0x05)
    1498        .dwendtag $C$DW$T$56
    1499
    1500        .dwattr $C$DW$T$56, DW_AT_decl_file("/opt/source/pru-software-support-package/include/am335x/p
    1501        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1502        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1503
    1504$C$DW$T$58      .dwtag  DW_TAG_union_type
    1505        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1506$C$DW$120       .dwtag  DW_TAG_member
    1507        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$36)
    1508        .dwattr $C$DW$120, DW_AT_name("IEPCLK")
    1509        .dwattr $C$DW$120, DW_AT_TI_symbol_name("IEPCLK")
    1510        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
